{
  "youtube": [
    {
      "idx": 85,
      "data": "i love her",
      "label": 0,
      "keywords": "love",
      "explanation": "the comment shows the commenter loves the singer in the video, it is not a spam since it refers to video content."
    },
    {
      "idx": 13,
      "data": "Her voice sounds weird and plus she&#39;s cute for a blonde",
      "label": 0,
      "keywords": "voice, cute, blonde",
      "explanation": "the comment mentions the singer's voice and her appearance, it is not a spam since it is related to video content."
    },
    {
      "idx": 99,
      "data": "I believe that soccer promotes terrorism. Bad choice, Shakira.",
      "label": 0,
      "keywords": "shakira",
      "explanation": "the comment is not a spam as it mentions the singer's name and express the commenter's opinion to her."
    },
    {
      "idx": 47,
      "data": "like!!!!!",
      "label": 0,
      "keywords": "like",
      "explanation": "the comment is not a spam as it express the commenter's attitude to the video."
    },
    {
      "idx": 33,
      "data": "Me and my aunt love this song!!!!!",
      "label": 0,
      "keywords": "love, song",
      "explanation": "the comment is not a spam as it shows the commenter love the song."
    },
    {
      "idx": 3,
      "data": "Check out these Irish guys cover  of Avicii&#39;s  Wake Me Up!  Just search...  &quot;wake me up Fiddle Me Silly&quot; Worth a listen  for the gorgeous fiddle player!",
      "label": 1,
      "keywords": "check, search",
      "explanation": "the comment ask the viewer to check out and search a player, which is indicative of a spam comment."
    },
    {
      "idx": 15,
      "data": "Echa un vistazo a la remezcla! / Check out the remix!  MILEY CYRUS - WRECKING BALL (THE HOUSE OF EDM REMIX)  MILEY CYRUS - WRECKING BALL (VINCENT T. REMIX)  ...click, enlace, suscríbase! / ...click, link, subscribe!",
      "label": 1,
      "keywords": "check, click, link, subscribe",
      "explanation": "the comment guide the viewer to look into a provided content not related to the video, which shows it is a spam."
    },
    {
      "idx": 29,
      "data": "Hey guys whats up? I found this app that lets you get free gift card vouchers like psn cards,X-box live cards and even amazon gift cards. For free! All you have to do is  simply just download the app from the app store. It is called juno wallet. All you have to do is just sign up for the app and then complete a few surveys or just download some other free apps and you get money like 10 cents. Also, if you type in the code IM2458444. You will also start off with $0.25 free!! ",
      "label": 1,
      "keywords": "app, free, download, store",
      "explanation": "the comment ask the viewer to download an app and get free vouchers, it is a spam since it is not related to the video."
    },
    {
      "idx": 50,
      "data": ":D subscribe to me for daily vines",
      "label": 1,
      "keywords": "subscribe",
      "explanation": "the comment ask the viewer to subscribe to another channel, which is a characteristic of spam comment."
    },
    {
      "idx": 61,
      "data": "Check out this playlist on YouTube",
      "label": 1,
      "keywords": "check, playlist",
      "explanation": "the comment ask the viewer to check out another playlist not related to the video, therefore it is a spam comment."
    }
  ],
  "sms": [
    {
      "idx": 121,
      "data": "u don't remember that old commercial?",
      "label": 0,
      "keywords": "remember, old, commercial",
      "explanation": "the message ask the receiver about an old commercial, so it is not a spam"
    },
    {
      "idx": 79,
      "data": "no da..today also i forgot..",
      "label": 0,
      "keywords": "today, forgot",
      "explanation": "the message says the sender forgot something today. It is not a spam as the message may be relevant to the receiver."
    },
    {
      "idx": 280,
      "data": "hmm ill have to think about it... ok you're forgiven! =d",
      "label": 0,
      "keywords": "think, forgiven",
      "explanation": "the message replies to a previous sent message, so it is not a spam."
    },
    {
      "idx": 467,
      "data": "no, i decided that only people who care about stuff vote and caring about stuff is for losers",
      "label": 0,
      "keywords": "decided, care, vote, stuff",
      "explanation": "the message talks about stuff vote problem which may be relevant to the receiver, so it is not a spam."
    },
    {
      "idx": 386,
      "data": "sorry i cant take your call right now. it so happens that there r 2waxsto do wat you want. she can come and ill get her medical insurance. and she'll be able to deliver and have basic care. i'm currently shopping for the right medical insurance for her. so just give me til friday morning. thats when i.ll see the major person that can guide me to the right insurance.",
      "label": 0,
      "keywords": "sorry, insurance",
      "explanation": "the message replies to a missed call and talks about insurance problems, so it is not a spam."
    },
    {
      "idx": 466,
      "data": "you are chosen to receive a ??350 award! pls call claim number 09066364311 to collect your award which you are selected to receive as a valued mobile customer.",
      "label": 1,
      "keywords": "chosen, award, call, selected",
      "explanation": "the message says the receiver is chosen for an award and ask the receiver to dial a number. It is likely a phishing message."
    },
    {
      "idx": 63,
      "data": "as a valued customer, i am pleased to advise you that following recent review of your mob no. you are awarded with a ??1500 bonus prize, call 09066364589",
      "label": 1,
      "keywords": "customer, awarded, prize, call",
      "explanation": "the message is likely to be a phishing message as it asks the receiver to dial a number to claim an award."
    },
    {
      "idx": 31,
      "data": "lyricalladie(21/f) is inviting you to be her friend. reply yes-910 or no-910. see her: www.sms.ac/u/hmmross stop? send stop frnd to 62468",
      "label": 1,
      "keywords": "reply, www, stop",
      "explanation": "the message links to a website and asks for structured reply, which indicates it is a spam message."
    },
    {
      "idx": 140,
      "data": "congratulations ur awarded either ??500 of cd gift vouchers & free entry 2 our ??100 weekly draw txt music to 87066 tncs www.ldew.com 1 win150ppmx3age16",
      "label": 1,
      "keywords": "congratulations, awarded, gift, vouchers, free, www, com",
      "explanation": "the message mentions free gifts and provides website link, which shows it is likely a phishing message."
    },
    {
      "idx": 236,
      "data": "think ur smart ? win ??200 this week in our weekly quiz, text play to 85222 now!t&cs winnersclub po box 84, m26 3uz. 16+. gbp1.50/week",
      "label": 1,
      "keywords": "win, quiz, winnersclub",
      "explanation": "the message asks the receiver to participate in a quiz to win an award, indicating it is a spam message."
    }
  ],
  "imdb": [
    {
      "idx": 2258,
      "data": "now please don t start calling me names like unpatriotic weirdo and more the very length of this movie hours is its biggest mistake no editing at all seems like j p dutta fell in love with his project too much even lagaan was hours long but it was entertaining and gave a message as well it s based on true incidents and real people kudos to it but were the repetitive war scenes really needed on top of it the focus constantly shifted from one battalion squadron to another and it was impossible to keep a track of them all between the skirmishes there were songs about loneliness lovesickness and related stuff there were chummy conversations in the beginning it gave some relief from the violence but became so monotonous later that one could even correctly predict nature of the forthcoming talk why were the soldiers walking around as if they were lions in jungle fully unaware that enemy was lurking somewhere near and when they were shot it elicited sympathy but it seemed unmindful of them to be so cocksure of their safety in the first place music was melodious and the lyrics were soulful but did not fit with the movie better to listen to them on the soundtrack rather than in the movie acting was the saving grace from seasoned veterans like sanjay dutt and ajay devgan to relative newbies like abhishek bachchan and akshaye khanna everyone acted like a pro manoj bajpai and ashutosh rana deserve a special mention for lightening up the mood whenever necessary dialogues ranged from brilliant from madhuri with love to illogical monotonous pakistan se zyada musalman hindusthan mein hain and the expletive spree consisting of all the mcs bcs cs and f words wasn t really required loc kargil attempts to provide a fitting tribute to the brave indian soldiers but tries too hard and ultimately fails indian soldiers surely deserve a better tribute",
      "label": 0,
      "keywords": "mistake, monotonous, fails",
      "explanation": "the review express negative attitube to the movie as the war scenes are too monotonous."
    },
    {
      "idx": 1510,
      "data": "ok let me again admit that i haven t seen any other merchant ivory the distributor films nor have i seen more celebrated works by the director so my capacity to discuss before the rains outside of analysis of the film itself is mitigated with that admittance let me begin before the rains is a different kind of movie that doesn t know which genre it wants to be at first it pretends to be a romance in most romances the protagonist falls in love with a supporting character is separated from the supporting character and is sometimes united with his or her partner this movie s hero has already won the heart of his lover but cannot be with her his name is henry moores and her name is sajani and they reside in southern india during the waning days of the raj british imperial rule henry has been away from london for a long time and has fallen in love with his married indian maid despite his legal marriage and child overseas what could be better than that they often sneak away for intimate afternoons until some children notice them word spreads to sajani s husband who questions her involvement with moores she denies any contact with him but moores asks her to leave the area sajani refuses because of her devotion to him and commits suicide please take note that these events occur in the opening third of the film the film changes tone and becomes a crime drama in its final portions sajani s body is discovered right as moores family comes to visit the alleged perpetrator is moores s english educated assistant t k t k knows of his master s affair but keeps silent until his life becomes threatened once he is declared innocent he attempts to regain his honor by killing moores t k is too squeamish and leaves him in a dirt path as the rains fall i want to warn you this isn t a romance film the dvd cover and theatrical posters show an indian woman and caucasian man embracing in an idealized tropic setting this image is captured directly from the film s opening but quickly disappears then it s over it seems like an effort to capitalize on western fixation on forbidden love it isn t effective at all not only is the movie not a romance but its characters lack any personality they are bundles of walking clich s moores is an arrogant white man who doesn t recognize his indian friend t k s intelligence t k is torn between his own heritage and his educative background sajani is a woman incapable of having a choice in her romantic life oh and of course moores family is inquisitive into sajani s death but still slightly racist to indians if the tone wasn t so serious i would be willing to overlook these problems but it isn t the film is presented with a didactic overtone which highlights its poor character development no this film isn t terrible other than the laughable screenplay it isn t poor the actors are all experienced and perform well here nandita das who plays sajani was part of wonderful indian drama water even director sivan has an impressive resume he recently oversaw the terrorist which is part of roger ebert s great movies collection what happened here why is this movie so bad well sivan mentioned how he was inspired to direct this film because of a short he viewed in israel called red roofs apparently the story was timeless and sivan sought to create a similar experience set in s india i don t have any problem with that approach but i think sivan may have been too motivated this time the actors cinematography and set design are acceptable but unless you share sivan s aura you ll probably not enjoy it my recommendation is that you presume you aren t in accordance with him and watch something else final consensus and out of",
      "label": 0,
      "keywords": "lack, poor, terrible",
      "explanation": "the review express disappointment on the character development of this film."
    },
    {
      "idx": 0,
      "data": "first the cgi in this movie was horrible i watched it during a marathon of bad movies on the scifi channel at the end when the owner of the park gets killed it s probably one of the worst examples of cgi i have even seen even night of the living dead had better animation that said the movie had almost no plot why were they on that island in particular well it wasn t stated in the movie and why would the people keep coming into the cat s area makes no sense one thing that stood out in this movie was moderately good acting in what could be called a b made for tv movie movie the acting was very good parry shen stood out in particular if you have absolutely nothing to do on a saturday watch this movie it may be good for some memorable quotes",
      "label": 0,
      "keywords": "horrible, bad, worst",
      "explanation": "the review express negative attitude as it says the movie is horrible and bad."
    },
    {
      "idx": 1168,
      "data": "this might be unbelievable but this movie has grossed in russia it s shown in almost all cinema theaters and still running well i have no idea why distributors put their eye on this particular uh movie which had almost no screening around the world that s some kind of enigma haha maybe it was based on the fact that another movie pledge this with paris hilton which was as well released only dvd almost everywhere had major screenings in russia and grossed more than mln besides both movies had a lot of promotion like there were the banners all over the city tv commercials and etc speaking about movie i d say it s dull and absolutely boring it could be better really even if it has jessica simpson",
      "label": 0,
      "keywords": "dull, boring",
      "explanation": "the review says the movie is dull and boring."
    },
    {
      "idx": 1814,
      "data": "dead husbands is a somewhat silly comedy about a bunch of wives conspiring to bump off each others husbands` it`s by no means embarrassingly bad like some comedies i could mention but it never fufils its potential imagine how good this could have been if we had the farrelly brothers directing ben stiller in the role of carter elson oh is carter based on jerry springer just curious because the catch phrase on dr elson`s show is look after each other and keep talking",
      "label": 0,
      "keywords": "silly, embarrassingly, bad",
      "explanation": "the review is negative as it thinks the movie is somewhat silly."
    },
    {
      "idx": 1701,
      "data": "this movie is an extremely funny and heartwarming story about an orphanage that is in financial trouble when the director goes on vacation his dad agrees to step in temporarily to run things this is positively the best work that leslie nielson has ever done his idea in the film to rent out children is immediately innovative and his sales techniques will definitely make you laugh the little girl in this movie is so sweet and charming that i know i will never forget her just make sure that you don t miss the first five minutes of the movie such great family entertainment is so rare these days if you go for slightly corny pictures with happy endings go for this one i could watch this over and over and i often do my only complaint about this movie is that it is so difficult to find a copy",
      "label": 1,
      "keywords": "funny, heartwarming, great",
      "explanation": "the review is positive as it describes the movie as funny and heartwarming."
    },
    {
      "idx": 1173,
      "data": "'this film is more about how children make sense of the world around them and how they and we use myth to make sense of it all i think it s been misperceived everyone going in expecting a stalkfest won t enjoy it but if you want a deeper story it s here'",
      "label": 1,
      "keywords": "misperceived, deeper",
      "explanation": "the review is positive because it believes people who don't like the movie misperceive it and believe the movie tells a deeper story."
    },
    {
      "idx": 1473,
      "data": "a stupid young man becomes obsessed with a woman so obsessed that he loses perspective and common sense an evil magician approaches him and informs him he can give him great wealth that he can use to win the lady s heart if he agrees to give him anything he wants that s within their room the dumb guy agrees and the magician steals the man s reflection out of the mirror and bad things naturally occur as a result if this film had been made just a decade later i am sure i wouldn t have been so charitable in reviewing and scoring this film after all the film s plot is a bit vague in spots and the acting is at times a bit stilted however when you consider that in full length films were rare and often only to minutes long plus the whole idea of a complex story like you get in this film is very unusual as stories were very short and broadly acted so given the limitations of the time this film is pretty good and is one of the earlier horror films known",
      "label": 1,
      "keywords": "unusual, good",
      "explanation": "the review sees the movie as a good one in general from its last sentence."
    },
    {
      "idx": 535,
      "data": "although released among a flock of revenge minded action flicks kill bill vol the punisher walking tall man on fire works as well as it does thanks in large part to the always watchable denzel washington one of the best actors around today in man on fire based on a j quinnell s novel first filmed in with scott glenn washington plays a down on his luck ex mercenary who has now stooped to drinking from a flash of jack daniels until his old partner christopher walken offers him a chance at redemption he is hired on as a bodyguard to the year old daughter dakota fanning of a mexican businessman marc antony and his american born wife radha mitchell while he and fanning work like oil and water first not mixing very well he really gets to form a bond with her encouraging her to do better at swimming while he at the same time attempts to deal with the demons of the past it is that very bond that will force washington back into his old line of work when fanning is kidnapped and held for a million ransom and he is nearly killed with almost any other stock action hero schwarzenneger segal etc the subsequent bloodbath would be the same repetitive schlock we ve seen a million times before but washington s character though he s killing for a reason does not particularly enjoy doing what he does still he gets help from a very intrepid mexican newspaper reporter rachel ticotin out to expose la hermanidad the brotherhood the kidnap gang responsible for fanning s abduction man on fire is flawed to some extent because of the hyper camera work nearly headache inducing montage editing and various film stocks that are par for the course of its director tony scott top gun crimson tide but which are not necessarily unique to him witness oliver stone s use of montage in jfk or sam peckinpah s in his classic s and s films still scott gets a very good performance from washington as well as fanning who comes across as far more than a typical movie brat kid harry gregson williams south of the border spanish guitar score is enhanced by soundtrack splashes of chopin debussy and even linda ronstadt s classic country rock version of blue bayou although the film overall is quite violent it is no worse than most action films of the last ten years and overall it is much better than most",
      "label": 1,
      "keywords": "well, better, best",
      "explanation": "the review is positive as it describes the movie as 'much better than most'"
    },
    {
      "idx": 2155,
      "data": "all of you who despaired looking at the emptiness and weaknesses of disney studios last productions here comes something that should heal your wounds once and for all a bug s life brings the proof that purely synthetic pictures conducting a good scenario provides more interest than fake hand made old disneys like drawings see the lion king pocahontas and all the latest productions where you sadly regret that bambi s magical background and atmosphere are gone forever a bug s life pattes for my fellow french cinemaniaks succeeds in avoiding all the imperfections that make you awaken in the middle of the movie and say hey this thing is computer generated no weak parts a tremendous effort showing its efficiency in the backgrounds and the general look of the sets an astonishing d bird close to perfection in its imitation of reality and that s only to mention the technical aspects the scenario my friends the real backbone of a motion picture has some thickness curiously and obviously thanks to lasseter s team there is practically no musical sequence in a bug s life which means the story is long and rich enough to free itself from these or minutes that some kids appreciate but most others dislike same thing for the parents or the anime fans like me this movie reminded me of a really old movie featuring steve martin and chevy chase the amigos it had basically the same background story a whole mexican village living in the fear of a few bad guys hires gunmen who finally turn to be actors to protect them etc simple but efficient and brilliantly adapted to a colony of frightened ants facing the wrath of vicious insects since microcosmos many movies tell tales of insects their lives fears and hopes but i do think that a bug s life is the funniest and best directed of all the humanisation process has been perfectly well achieved and the whole audience was captivated by flik s aka tilt in france adventures a big thank you for lasseter s team especially for the last seconds it s so strange and great at the same time to see a whole theater caught in laughter while the bugs actors forget their lines or hit the camera and finally especially for those of you who have seen the french version other congratulations go to the dubbing actors who made a great synchro work on this movie a bug s life is a really good piece of entertainment and i think it will soon become part of my collection of videos a privilege granted to extremely few movies and that s not a problem of storage room go and see it that s an order",
      "label": 1,
      "keywords": "great, laughter, good",
      "explanation": "the review think the movie is good and recommend people to see it."
    }
  ],
  "yelp": [
    {
      "idx": 2251,
      "data": "Service was slow.  7 rolls came out one at a time over the course of 45 minutes so that no one really ate together.  At the end  a gratuity was automatically added.  We had a party of 5.  Never heard of an automatic gratuity for a party of 5  but then again  I have never had worse service.",
      "label": 0,
      "keywords": "slow, worse",
      "explanation": "the review is negative due to slow service and automatic gratuity."
    },
    {
      "idx": 3265,
      "data": "We went in for the evening meal on a Friday  we were seated in a reasonable time frame but the restraint was very noisy and not much for ambiance. We ordered our pizza and due to my wife having allergies the pie was asked to only have sauce on one side. When the pizza arrived it was not to order. We asked for a personal size pizza to be made so she could eat. By the time her pizza arrived I was done earthing and had to have the smaller pizza boxed and saved for later. Although the the small pie was comped we go out to eat as a couple. The pizza was runny and not worth the money. It was comparable to Dominoes except for the price. I don't believe we will be going back to this wanna be pizzeria.",
      "label": 0,
      "keywords": "runny, price",
      "explanation": "the reviewer think the pizza is runny and not worth the price."
    },
    {
      "idx": 1522,
      "data": "'Maybe it\\'s because I\\'m an old fogey but the frenetic music they pumped into the dining room just ruined the whole dinner.'",
      "label": 0,
      "keywords": "ruined",
      "explanation": "the review is negative as the reviewer think the music played ruined the dinner."
    },
    {
      "idx": 1811,
      "data": "A 12 oz. of Dos Equis for $8? The only reason we went here was to meet some friends who were staying in the Flamingo. I told the bartender the last time I paid that much for a beer was when I was drinking a craft beer. It was a Ballast Point Sculpin to be exact. Then I asked him why this bar does not offer more selection than Coors  Budweiser  Corona and Dos Equis and he said most people prefer these beers. Really? The only reason they prefer these beers is due to the lack of selection at this place and other places on The Strip. I told him he should offer craft beer to differentiate this place from other places. Apparently he was not open to the suggestion. With that attitude and way of thinking   I will be shocked if this bar is still around when I return to Vegas. Adios Carlos' n Charlie's.",
      "label": 0,
      "keywords": "lack, shocked, adios",
      "explanation": "the review is negative as it think the beer sold is too expensive and have few choices."
    },
    {
      "idx": 3785,
      "data": "This Loco Patron location just opened this week so take this review with a grain of margarita salt. They could very well improve.\\n\\nI'm a sucker for good margaritas and have seen the signs announcing this joint for months  so when I saw it open I had to take a look.\\n\\nMy first impression is that they've built a nice little sports bar  but furnished it like a Mexican food joint. TVs all over the wall and bar  saccharine pop/rock playing over the speakers  and a rustic cabinet where they keep straws  napkins  and the servers' purses. It's a medium-sized place  not big enough for a huge crowd  but it'd likely handle about half an hour of a pub crawl stop before the place got uncomfortable and folks moved on.\\n\\nI sidled up to the bar and asked for a house margarita and a menu  both came back quickly along with a free mini-basket of chips and salsa. The salsa was actually really good  mild for the gringos but just a little kick on the backend. The margarita  on the other hand  was pretty awful. It had the right color  but the guy at the bar used way too much sweet and not nearly enough sour. It tasted like a flat sprite. I also couldn't tell if there was actually alcohol in there  which is never a good sign.\\n\\nI ordered fajitas and those were also a little sweet for some odd reason. Maybe not enough salt when they cooked it up  I don't know. In any case  it was edible but not at all remarkable. \\n\\nWhen the bill came the barman rang me up for the wrong dish  overcharging me  but when I pointed out the mistake he quickly fixed it so no real harm done.\\n\\nMill Avenue has a bunch of existing Mexican food places  all with their own charms  and I don't understand why a business owner thought Mill Ave. needed another. So far these folks aren't doing anything which sets them apart from the others and I'd be surprised to see them still open this time next year. That said  I'd welcome improvements that prove me wrong. The ball is in your court  Loco Patron.",
      "label": 0,
      "keywords": "uncomfortable, awful, surprised",
      "explanation": "the review is negative as it think the food offered in the restaurant is awful."
    },
    {
      "idx": 3788,
      "data": "Jackie was great! My husband doesn't like photo shoots  but she made both of us feel really comfortable. She had tons of ideas and the pictures turned out beautiful! She's also extremely fast at editing and getting you your photos. We waited several months for our wedding photos  and Jackie had our maternity pictures edited in less than a week! Definitely a bang for your buck!",
      "label": 1,
      "keywords": "great, comfortable, beautiful",
      "explanation": "the review is positive as the customer feel comfortable and get beautiful photos."
    },
    {
      "idx": 1139,
      "data": "The waiter we had was great! We asked him what were the best sellers and he was able to tell us what was on the menu and the ingredients of each plate. The guy who brought out our app and main courses needed to learn some manners  but overall great experience. 4 stars because thy were out of sweet potato fries and because the food runner needed to pull his pants up and be a little nicer.",
      "label": 1,
      "keywords": "great",
      "explanation": "the review is positive as it compliments the waiter."
    },
    {
      "idx": 3664,
      "data": "Wait was not as long as expected (around 25 mins) and they even send texts to your phone as your table is ready  a very nice opportunity to walk around rather than wasting time standing in a line. \\n\\nI ordered the Chanterelle burger  Truffle Parmesan fries  and a chocolate shake. The burger was fantastic  one of the best I've ever had. The fries were good as well but a bit strong for my taste. They were good due to the refreshing experience the fries offered; never before have I tasted anything like it. The shake was top notch as well. The bill holder is fitted with an iPod touch so customers can conveniently leave their remarks. \\n\\nThe table I sat at seemed a bit close to other patrons on both sides of me  sort of like a speed dating row of tables. But I didn't find it uncomfortable. It sometimes gave my party a chance to recommend a good dish to someone just being seated. I'm sure it could also work vice versa. \\n\\nI had a wonderful experience at BurGR. Couldn't recommend it any more.",
      "label": 1,
      "keywords": "fantastic, best, good, refreshing, wonderful, recommend",
      "explanation": "the review recommends the restaurant for its good foods."
    },
    {
      "idx": 2829,
      "data": "We happened to be going by here and on an impulse decided to stop.\\n\\nIt's a tiny place right on the road.  They have a drive through and a walk-up window.  When we visited there were two young  very enthusiastic people inside.  They had several coffees available  as well as some Italian soda.  My wife had the coffee  I tried the soda.  We were both very happy with our choices.  I'd probably give it 3.5 stars if I could  but I can't.  And the enthusiastic service has to count for something  so we'll go with four stars.\\n\\nThey also have a stamp card so you can get a free beverage when you fill it.",
      "label": 1,
      "keywords": "happy, enthusiastic",
      "explanation": "the review is positive as the reviewer is happy for the restaurant's food and enthusiastic services."
    },
    {
      "idx": 2849,
      "data": "DLUX has great burgers and even better fries. I\\'ve been here a number of times and I have never had a bad time or meal. The same goes for the drinks - their specialty cocktails are always mixed perfectly.",
      "label": 1,
      "keywords": "great, better, perfectly",
      "explanation": "the review is positive for the great food offered."
    }
  ],
  "cdr": [
    {
      "idx": 143,
      "data_snippet": "OBJECTIVE: To report the incidence and management of elevated intraocular pressure (IOP) in patients with uveitis treated with the fluocinolone acetonide (FA) intravitreal implant. Does fluocinolone acetonide cause uveitis?",
      "data": "OBJECTIVE: To report the incidence and management of elevated intraocular pressure (IOP) in patients with uveitis treated with the fluocinolone acetonide (FA) intravitreal implant. DESIGN: Pooled data from 3 multicenter, double-masked, randomized, controlled, phase 2b/3 clinical trials evaluating the safety and efficacy of the 0.59-mg or 2.1-mg FA intravitreal implant or standard therapy were analyzed. RESULTS: During the 3-year follow-up, 71.0% of implanted eyes had an IOP increase of 10 mm Hg or more than baseline and 55.1%, 24.7%, and 6.2% of eyes reached an IOP of 30 mm Hg or more, 40 mm Hg or more, and 50 mm Hg or more, respectively. Topical IOP-lowering medication was administered in 74.8% of implanted eyes, and IOP-lowering surgeries, most of which were trabeculectomies (76.2%), were performed on 36.6% of implanted eyes. Intraocular pressure-lowering surgeries were considered a success (postoperative IOP of 6-21 mm Hg with or without additional IOP-lowering medication) in 85.1% of eyes at 1 year. The rate of hypotony (IOP </= 5 mm Hg) following IOP-lowering surgery (42.5%) was not different from that of implanted eyes not subjected to surgery (35.4%) (P = .09). CONCLUSION: Elevated IOP is a significant complication with the FA intravitreal implant but may be controlled with medication and surgery. Does fluocinolone acetonide cause uveitis?",
      "label": 0,
      "keywords": "treated with",
      "regex": "{{B}}.{0,20}treated with.{0,50}{{A}}",
      "explanation": "The statement describes a study analyzing the incidence and management of elevated intraocular pressure (IOP) in patients with uveitis treated with the fluocinolone acetonide (FA) intravitreal implant. It does not provide any information suggesting that fluocinolone acetonide causes uveitis. Instead, it discusses the complications and management of elevated IOP associated with the use of the FA intravitreal implant."
    },
    {
      "idx": 882,
      "data_snippet": "A newborn with massive tricuspid regurgitation, atrial flutter, congestive heart failure, and a high serum lithium level is described. Does lithium cause congestive heart failure?",
      "data": "Tricuspid valve regurgitation and lithium carbonate toxicity in a newborn infant. A newborn with massive tricuspid regurgitation, atrial flutter, congestive heart failure, and a high serum lithium level is described. This is the first patient to initially manifest tricuspid regurgitation and atrial flutter, and the 11th described patient with cardiac disease among infants exposed to lithium compounds in the first trimester of pregnancy. Sixty-three percent of these infants had tricuspid valve involvement. Lithium carbonate may be a factor in the increasing incidence of congenital heart disease when taken during early pregnancy. It also causes neurologic depression, cyanosis, and cardiac arrhythmia when consumed prior to delivery. Does lithium cause congestive heart failure?",
      "label": 0,
      "keywords": "NA",
      "regex": "'{{A}}.{0,20}and.{0,20}{{B}}'[SEP]'{{B}}.{0,20}and.{0,20}{{A}}'[SEP]'{{A}}.{0,50}may be.{0.50}{{B}}'",
      "explanation": "The statement describes a case of a newborn with massive tricuspid regurgitation, atrial flutter, congestive heart failure, and a high serum lithium level. It also mentions that there have been other cases of cardiac disease among infants exposed to lithium compounds during the first trimester of pregnancy. However, it only conclude that lithium carbonate causes neurologic depression, cyanosis, and cardiac arrhythmia when consumed prior to delivery. There is no clear evidence that lithium causes congestive heart failure from the study."
    },
    {
      "idx": 886,
      "data_snippet": "The present data indicate that the determination of malondialdehyde, oxypurines, and nucleosides in peripheral blood, may be used to monitor the metabolic alterations of tissues occurring during ischemic phenomena.(ABSTRACT TRUNCATED AT 250 WORDS). Does nucleosides cause ischemic?",
      "data": "Time dependence of plasma malondialdehyde, oxypurines, and nucleosides during incomplete cerebral ischemia in the rat. ncomplete cerebral ischemia (30 min) was induced in the rat by bilaterally clamping the common carotid arteries. Peripheral venous blood samples were withdrawn from the femoral vein four times (once every 5 min) before ischemia (0 time) and 5, 15, and 30 min after ischemia. Plasma extracts were analyzed by a highly sensitive high-performance liquid chromatographic method for the direct determination of malondialdehyde, oxypurines, and nucleosides. During ischemia, a time-dependent increase of plasma oxypurines and nucleosides was observed. Plasma malondialdehyde, which was present in minimal amount at zero time (0.058 mumol/liter plasma; SD 0.015), increased after 5 min of ischemia, resulting in a fivefold increase after 30 min of carotid occlusion (0.298 mumol/liter plasma; SD 0.078). Increased plasma malondialdehyde was also recorded in two other groups of animals subjected to the same experimental model, one receiving 20 mg/kg b.w. of the cyclooxygenase inhibitor acetylsalicylate intravenously immediately before ischemia, the other receiving 650 micrograms/kg b.w. of the hypotensive drug nitroprusside at a flow rate of 103 microliters/min intravenously during ischemia, although in this latter group malondialdehyde was significantly higher. The present data indicate that the determination of malondialdehyde, oxypurines, and nucleosides in peripheral blood, may be used to monitor the metabolic alterations of tissues occurring during ischemic phenomena.(ABSTRACT TRUNCATED AT 250 WORDS).Does nucleosides cause ischemic?",
      "label": 0,
      "keywords": "determination, monitor",
      "regex": "{{A}}.{0,50}during.{0,50}{{B}}",
      "explanation": "Based on the information provided, the study investigates the time-dependent changes in plasma levels of malondialdehyde, oxypurines, and nucleosides during incomplete cerebral ischemia in rats. It does not directly indicate whether nucleosides cause ischemia."
    },
    {
      "idx": 626,
      "data_snippet": "In the present study we aimed to investigate plasma levels of CGRP during headache induced by the NO donor glyceryl trinitrate (GTN) in 16 patients with chronic tension-type headache and 16 healthy controls. Does glyceryl trinitrate cause tension-type headache?",
      "data": "Calcitonin gene-related peptide levels during nitric oxide-induced headache in patients with chronic tension-type headache. It has been proposed that nitric oxide (NO) induced headache in primary headaches may be associated with release of calcitonin gene-related peptide (CGRP). In the present study we aimed to investigate plasma levels of CGRP during headache induced by the NO donor glyceryl trinitrate (GTN) in 16 patients with chronic tension-type headache and 16 healthy controls. The subjects were randomly allocated to receive 0.5 microg/kg/min GTN or placebo over 20 min on two headache-free days. Blood samples were collected at baseline, 10, 20 and 60 min after start of infusion. Both patients and controls developed significantly stronger immediate headache on the GTN day than on the placebo day and the headache was significantly more pronounced in patients than in controls. There was no difference between the area under the CGRP curve (AUCCGRP) on GTN vs. placebo day in either patients (P=0.65) or controls (P=0.48). The AUCCGRP recorded on the GTN day did not differ between patients and controls (P=0.36). Both in patients and controls, CGRP levels changed significantly over time, on both the GTN and placebo days (P < 0.05). The present study indicates that NO-induced immediate headache is not associated with release of CGRP. Does glyceryl trinitrate cause tension-type headache?",
      "label": 0,
      "keywords": "chronic",
      "regex": "None",
      "explanation": "The study compares palsma levels of CGRP during headache induced by the NO donor glyceryl trinitrate (GTN). 16 patients with chronic tension-type headache participate in the study. While glyceryl trinitrate causes instant headache, the tension-type headache is chronic and is not induced by glyceryl trinitrate."
    },
    {
      "idx": 640,
      "data_snippet": "Tiapride, a substituted benzamide derivative closely related to metoclopramide, reduced levodopa-induced peak dose involuntary movements in 16 patients with idiopathic Parkinson\\'s disease. Does metoclopramide cause involuntary movements?",
      "data": "Tiapride in levodopa-induced involuntary movements. Tiapride, a substituted benzamide derivative closely related to metoclopramide, reduced levodopa-induced peak dose involuntary movements in 16 patients with idiopathic Parkinson's disease. However, an unacceptable increase in disability from Parkinsonism with aggravation of end-of-dose akinesia led to its cessation in 14 patients. Tiapride had no effect on levodopa-induced early morning of \"off-period\" segmental dystonia. These results fail to support the notion that levodopa-induced dyskinesias are caused by overstimulation of a separate group of dopamine receptors. Does metoclopramide cause involuntary movements?",
      "label": 0,
      "keywords": "reduced, related to",
      "regex": "{{A}}.{0,50}reduc(e|es|ed).{0,50}{{B}}",
      "explanation": "The claim states that tiapride, which is closely related to metoclopramide, reduced levodopa-induced involuntary movements. However, this reduction led to an increase in disability and cessation of tiapride in some patients. This suggests that metoclopramide may also have similar effects, but the statement does not provide evidence of a causal relationship between metoclopramide and involuntary movements."
    },
    {
      "idx": 633,
      "data_snippet": "Intraperitoneal administration of atropine, naloxone, mecamylamine, and hexamethonium to mice reduced catalepsy induced by a combination of morphine with nicotine. Does morphine cause catalepsy?",
      "data": "Nicotine potentiation of morphine-induced catalepsy in mice. In the present study, effects of nicotine on catalepsy induced by morphine in mice have been investigated. Morphine but not nicotine induced a dose-dependent catalepsy. The response of morphine was potentiated by nicotine. Intraperitoneal administration of atropine, naloxone, mecamylamine, and hexamethonium to mice reduced catalepsy induced by a combination of morphine with nicotine. Intracerebroventricular injection of atropine, hexamethonium, and naloxone also decreased catalepsy induced by morphine plus nicotine. Intraperitoneal administration of atropine, but not intraperitoneal or intracerebroventricular injection of hexamethonium, decreased the effect of a single dose of morphine. It was concluded that morphine catalepsy can be elicited by opioid and cholinergic receptors, and the potentiation of morphine induced by nicotine may also be mediated through cholinergic receptor mechanisms. Does morphine cause catalepsy?",
      "label": 1,
      "keywords": " morphine-induced catalepsy, induced by",
      "regex": "'{{A}}-induced {{B}}'[SEP]'{{B}} induced by {{A}}'",
      "explanation": "Based on the given information, it can be concluded that morphine causes catalepsy. The study investigates the effects of nicotine on catalepsy induced by morphine and concludes that morphine, but not nicotine, induces a dose-dependent catalepsy. Additionally, the administration of atropine, naloxone, mecamylamine, and hexamethonium reduces catalepsy induced by the combination of morphine with nicotine. This suggests a causal relationship between morphine and catalepsy."
    },
    {
      "idx": 256,
      "data_snippet": "During dipyridamole-induced hyperemia, 12 of the 16 dogs with a partial coronary stenosis had a visible area of hypoperfusion by contrast echocardiography. Does dipyridamole cause hyperemia?",
      "data": "Relation of perfusion defects observed with myocardial contrast echocardiography to the severity of coronary stenosis: correlation with thallium-201 single-photon emission tomography. It has been previously shown that myocardial contrast echocardiography is a valuable technique for delineating regions of myocardial underperfusion secondary to coronary occlusion and to critical coronary stenoses in the presence of hyperemic stimulation. The aim of this study was to determine whether myocardial contrast echocardiography performed with a stable solution of sonicated albumin could detect regions of myocardial underperfusion resulting from various degrees of coronary stenosis. The perfusion defect produced in 16 open chest dogs was compared with the anatomic area at risk measured by the postmortem dual-perfusion technique and with thallium-201 single-photon emission tomography (SPECT). During a transient (20-s) coronary occlusion, a perfusion defect was observed with contrast echocardiography in 14 of the 15 dogs in which the occlusion was produced. The perfusion defect correlated significantly with the anatomic area at risk (r = 0.74; p less than 0.002). During dipyridamole-induced hyperemia, 12 of the 16 dogs with a partial coronary stenosis had a visible area of hypoperfusion by contrast echocardiography. The four dogs without a perfusion defect had a stenosis that resulted in a mild (0% to 50%) reduction in dipyridamole-induced hyperemia. The size of the perfusion defect during stenosis correlated significantly with the anatomic area at risk (r = 0.61; p = 0.02). Thallium-201 SPECT demonstrated a perfusion defect in all 14 dogs analyzed during dipyridamole-induced hyperemia; the size of the perfusion defect correlated with the anatomic area at risk (r = 0.58; p less than 0.03) and with the perfusion defect by contrast echocardiography (r = 0.58; p less than 0.03). Thus, myocardial contrast echocardiography can be used to visualize and quantitate the amount of jeopardized myocardium during moderate to severe degrees of coronary stenosis. The results obtained show a correlation with the anatomic area at risk similar to that obtained with thallium-201 SPECT. Does dipyridamole cause hyperemia?",
      "label": 1,
      "keywords": "dipyridamole-induced hyperemia",
      "regex": "{{A}}-induced {{B}}",
      "explanation": "The claim states that during dipyridamole-induced hyperemia, dogs with a partial coronary stenosis had a visible area of hypoperfusion by contrast echocardiography. This suggests that dipyridamole causes hyperemia."
    },
    {
      "idx": 627,
      "data_snippet": "In the present study we aimed to investigate plasma levels of CGRP during headache induced by the NO donor glyceryl trinitrate (GTN) in 16 patients with chronic tension-type headache and 16 healthy controls. Does GTN cause headache?",
      "data": "Calcitonin gene-related peptide levels during nitric oxide-induced headache in patients with chronic tension-type headache. It has been proposed that nitric oxide (NO) induced headache in primary headaches may be associated with release of calcitonin gene-related peptide (CGRP). In the present study we aimed to investigate plasma levels of CGRP during headache induced by the NO donor glyceryl trinitrate (GTN) in 16 patients with chronic tension-type headache and 16 healthy controls. The subjects were randomly allocated to receive 0.5 microg/kg/min GTN or placebo over 20 min on two headache-free days. Blood samples were collected at baseline, 10, 20 and 60 min after start of infusion. Both patients and controls developed significantly stronger immediate headache on the GTN day than on the placebo day and the headache was significantly more pronounced in patients than in controls. There was no difference between the area under the CGRP curve (AUCCGRP) on GTN vs. placebo day in either patients (P=0.65) or controls (P=0.48). The AUCCGRP recorded on the GTN day did not differ between patients and controls (P=0.36). Both in patients and controls, CGRP levels changed significantly over time, on both the GTN and placebo days (P < 0.05). The present study indicates that NO-induced immediate headache is not associated with release of CGRP. Does GTN cause headache?",
      "label": 1,
      "keywords": "induced by",
      "regex": "{{B}} induced by.{0,50}{{A}}",
      "explanation": "The claim states that both patients and controls developed significantly stronger immediate headache on the GTN day than on the placebo day. This suggests that GTN causes headache."
    },
    {
      "idx": 750,
      "data_snippet": "Here, we show that oral (5 mg/kg) or intrastriatal administration (0.1 and 0.5 nmol) of AMN082 reverses haloperidol-induced catalepsy in rats. Does haloperidol cause catalepsy?",
      "data": "Metabotropic glutamate 7 receptor subtype modulates motor symptoms in rodent models of Parkinson's disease. Metabotropic glutamate (mGlu) receptors modulate synaptic transmission in the central nervous system and represent promising therapeutic targets for symptomatic treatment of Parkinson's disease (PD). Among the eight mGlu receptor subtypes, mGlu7 receptor is prominently expressed in the basal ganglia, but its role in restoring motor function in animal models of PD is not known. The effects of N,N'-dibenzhydrylethane-1,2-diamine dihydrochloride (AMN082), the first selective allosteric activator of mGlu7 receptors, were thus tested in different rodent models of PD. Here, we show that oral (5 mg/kg) or intrastriatal administration (0.1 and 0.5 nmol) of AMN082 reverses haloperidol-induced catalepsy in rats. AMN082 (2.5 and 5 mg/kg) reduces apomorphine-induced rotations in unilateral 6-hydroxydopamine (6-OHDA)-lesioned rats. In a more complex task commonly used to evaluate major akinetic symptoms of PD patients, 5 mg/kg AMN082 reverses the increased reaction time to respond to a cue of bilateral 6-OHDA-lesioned rats. In addition, AMN082 reduces the duration of haloperidol-induced catalepsy in a mGlu7 receptor-dependent manner in wild-type but not mGlu7 receptor knockout mice. Higher doses of AMN082 (10 and 20 mg/kg p.o.) have no effect on the same models of PD. Overall these findings suggest that mGlu7 receptor activation can reverse motor dysfunction associated with reduced dopamine activity. Selective ligands of mGlu7 receptor subtypes may thus be considered as promising compounds for the development of antiparkinsonian therapeutic strategies. Does haloperidol cause catalepsy?",
      "label": 1,
      "keywords": "haloperidol-induced catalepsy",
      "regex": "{{A}}-induced {{B}}",
      "explanation": "The claim states that haloperidol-induced catalepsy can be reversed by the administration of AMN082, a selective allosteric activator of mGlu7 receptors. This suggests that haloperidol causes catalepsy."
    },
    {
      "idx": 197,
      "data_snippet": "The current data showed that pilocarpine significantly delayed onset of arrhythmias, decreased the time course of ventricular tachycardia and fibrillation, reduced arrhythmia score, and increased the survival time of arrhythmic rats and guinea pigs. [Ca(2+)](i) overload induced by aconitine or ouabain was reduced in isolated myocytes pretreated with pilocarpine. Does ouabain cause arrhythmia?",
      "data": "The antiarrhythmic effect and possible ionic mechanisms of pilocarpine on animal models. This study was designed to evaluate the effects of pilocarpine and explore the underlying ionic mechanism, using both aconitine-induced rat and ouabain-induced guinea pig arrhythmia models. Confocal microscopy was used to measure intracellular free-calcium concentrations ([Ca(2+)](i)) in isolated myocytes. The current data showed that pilocarpine significantly delayed onset of arrhythmias, decreased the time course of ventricular tachycardia and fibrillation, reduced arrhythmia score, and increased the survival time of arrhythmic rats and guinea pigs. [Ca(2+)](i) overload induced by aconitine or ouabain was reduced in isolated myocytes pretreated with pilocarpine. Moreover, M(3)-muscarinic acetylcholine receptor (mAChR) antagonist 4-DAMP (4-diphenylacetoxy-N-methylpiperidine-methiodide) partially abolished the beneficial effects of pilocarpine. These data suggest that pilocarpine produced antiarrhythmic actions on arrhythmic rat and guinea pig models induced by aconitine or ouabain via stimulating the cardiac M(3)-mAChR. The mechanism may be related to the improvement of Ca(2+) handling. Does ouabain cause arrhythmia?",
      "label": 1,
      "keywords": "ouabain-induced, induced by",
      "regex": "'{{A}}-induced.{0,50}{{B}}'[SEP]'{{B}} induced by.{0,50}{{A}}'",
      "explanation": " The study investigates the effects of pilocarpine on ouabain-induced arrhythmia in animal models. It is stated that pilocarpine reduced arrhythmia and improved the survival time of arrhythmic rats and guinea pigs. This suggests that ouabain causes arrhythmia, and pilocarpine acts as an antiarrhythmic agent by reducing the effects of ouabain."
    }
  ],
  "chemprot": [
    {
      "idx": 1516,
      "data": "Co-C bond activation in methylmalonyl-CoA mutase by stabilization of the post-homolysis product Co2+ cobalamin. What is the relationship between methylmalonyl-CoA mutase and Co-C?",
      "label": 0,
      "keywords": "in",
      "regex": "{{A}}.{0,50}in.{0,50}{{B}}[SEP]{{B}}.{0,50}in.{0,50}{{A}}",
      "explanation": "Co-C bond activation is in methylmalonyl-CoA mutase, so Co-C is part of methylmalonyl-CoA mutase."
    },
    {
      "idx": 917,
      "data": "Alcohol modulates expression of DNA methyltranferases and methyl CpG-/CpG domain-binding proteins in murine embryonic fibroblasts. What is the relationship between DNA methyltranferases and Alcohol?",
      "label": 1,
      "keywords": "modulates",
      "regex": "{{A}}.{0,100}modulat.{0,100}{{B}}[SEP]{{B}}.{0,100}modulat.{0,100}{{A}}",
      "explanation": "Alcohol modulates expression of DNA methyltranferases, so it is a regulator for DNA methyltranferases."
    },
    {
      "idx": 1179,
      "data": "These results suggest that LTD4 increases Aβ peptide burden via activation of CysLT(1)R, which further affects APP levels and activity of β- and γ-secretases via the NF-κB pathway. What is the relationship between CysLT(1)R and LTD4?",
      "label": 2,
      "keywords": "activation",
      "regex": "{{A}}.{0,100}increa.{0,100}{{B}}[SEP]{{A}}.{0,100}activ.{0,100}{{B}}[SEP]{{B}}.{0,100}increa.{0,100}{{A}}[SEP]{{B}}.{0,100}activ.{0,100}{{A}}",
      "explanation": "LtD4 activates CysLT(1)R, so it is an upregulator for CysLT(1)R."
    },
    {
      "idx": 2248,
      "data": "BACKGROUND: Since the introduction of the first cholinesterase inhibitor (ChEI) in 1997, most clinicians and probably most patients would consider the cholinergic drugs, donepezil, galantamine and rivastigmine, to be the first line pharmacotherapy for mild to moderate Alzheimer's disease.The drugs have slightly different pharmacological properties, but they all work by inhibiting the breakdown of acetylcholine, an important neurotransmitter associated with memory, by blocking the enzyme acetylcholinesterase. What is the relationship between cholinesterase and rivastigmine?",
      "label": 3,
      "keywords": "inhibitor, inhibiting",
      "regex": "{{B}}.{0.100}inhibit.{0,100}{{A}}[SEP]{{A}}.{0,100}inhibit.{0,100}{{B}}",
      "explanation": "rivastigmine is an inhibitor of cholinesterase, so it is a downregulator for cholinesterase."
    },
    {
      "idx": 957,
      "data": "Although generally highly specific for angiotensin II type 1 receptors, some ARBs, particularly telmisartan, are partial agonists at peroxisome proliferator-activated receptor-γ. What is the relationship between peroxisome proliferator-activated receptor-γ and telmisartan?",
      "label": 4,
      "keywords": "agonists",
      "regex": "{{A}}.{0,100}agnoist.{0,100}{{B}}[SEP]{{B}}.{0,100}agonist.{0,100}{{A}}",
      "explanation": "The message claims that telmisartan is an agonist for peroxisome proliferator-activated receptor-γ."
    },
    {
      "idx": 212,
      "data": "To test this, we studied the possible effect of the endothelin receptor antagonist, bosentan (50 and 100 mg kg(-1)) on serum glucose and insulin levels as well as on liver glycogen contents in normoglycemic stressed animals. What is the relationship between endothelin receptor and bosentan?",
      "label": 5,
      "keywords": "antagonist",
      "regex": "{{A}}.{0,100}antagonist.{0,100}{{B}}[SEP]{{B}}.{0,100}antagonist.{0,100}{{A}}",
      "explanation": "The sentence claims that bosentan is an antagonist to the endothelin receoptor."
    },
    {
      "idx": 1399,
      "data": "Rapamycin is a canonical allosteric inhibitor of the mTOR kinase with immunosuppressive and pro-apoptotic activities. What is the relationship between mTOR and Rapamycin?",
      "label": 6,
      "keywords": "inhibitor",
      "regex": "{{A}}.{0,100}inhibit.{0,100}{{B}}[SEP]{{B}}.{0,100}inhibit.{0,100}{{A}}",
      "explanation": "the sentence claims that Rapamycin is a canonical allosteric inhibitor of the mTOR kinase."
    },
    {
      "idx": 888,
      "data": "Tetrahydrobiopterin [(6R)-5,6,7,8-tetrahydro-L-biopterin, H(4)biopterin] is one of several cofactors of nitric oxide synthases (EC 1.14.13.39). What is the relationship between nitric oxide synthases and H(4)biopterin?",
      "label": 7,
      "keywords": "cofactors",
      "regex": "{{A}}.{0,100}cofactor.{0,100}{{B}}[SEP]{{B}}.{0,100}cofactor.{0,100}{{A}}",
      "explanation": "The sentence says H(4)biopterin is a cofactor of nitric oxide synthases."
    },
    {
      "idx": 731,
      "data": "Diacylglycerol (DAG) acts as an allosteric activator of protein kinase C (PKC) and is converted to phosphatidic acid by DAG kinase (DGK). What is the relationship between DAG kinase and DAG?",
      "label": 8,
      "keywords": "converted to",
      "regex": "{{A}}.{0,100}convert.{0,100}by {{B}}[SEP]{{B}}.{0,100}convert.{0,100}by {{A}}",
      "explanation": "DAG is converted to phosphatidic acid by DAG kinase, so DAG kinase is a substrate for DAG."
    },
    {
      "idx": 200,
      "data": "Almost all patients with SUR1 (38/41) or KIR6.2 (5/7) mutations were resistant to diazoxide. What is the relationship between KIR6.2 and diazoxide?",
      "label": 9,
      "keywords": "resistant",
      "regex": "None",
      "explanation": "Most patients with KIR6.2 mutations were resistant to diazoxide. The relationship between KIR6.2 and diazoxide is not listed in other classes."
    }
  ],
  "agnews": [
    {
      "idx": 96057,
      "data": "George W. Bush, Vladimir Putin, and leaders from other 19 Asian - Pacific nations including China #39;s Hu Jintao and Japan #39;s Junichiro Koizumi are beggining to arrive in Santiago to attend to Chile #39;s APEC summit on Saturday.",
      "label": 0,
      "keywords": "George W. Bush, Vladimir Putin, leaders, Asian - Pacific nations, China, Hu Jintao, Japan,  Junichiro Koizumi, APEC",
      "explanation": "This sentence says leaders from various countries came to Santiago to attend APEC summit, therefore it is related to world news."
    },
    {
      "idx": 96077,
      "data": "AP - Syracuse coach Jim Boeheim is known for his cutting wit, and even his star players can wind up on the receiving end. Preseason All-America Hakim Warrick scored 17 of his 21 points in the second half to lead the fifth-ranked Orange to a 71-58 victory over No. 12 Mississippi State on Thursday night in the semifinals of the Coaches vs. Cancer Classic.",
      "label": 1,
      "keywords": "coach, star players, Preseason, scored, semifinals",
      "explanation": "This sentence discusses a game between two university teams, therefore it is related to sports."
    },
    {
      "idx": 96138,
      "data": "Nike co-founder Phil Knight has announced that he will step down as chief executive and president of the company. The 66-year-old notified the company #39;s board of directors at ",
      "label": 2,
      "keywords": "co-founder, chief executive, company, board of directors",
      "explanation": "This sentence is about Nike company's personnel changes, therefore it is related to business."
    },
    {
      "idx": 96222,
      "data": "LONDON (Reuters) - Microsoft Corp., the world's largest  software maker, has expanded its flagship MSN Hotmail internet  email service to include European and Japanese domain names, it  said on Friday.",
      "label": 3,
      "keywords": "Microsoft, software, email service",
      "explanation": "This sentence discusses the service extension of Microsoft Crop., which is a high tech company. Therefore, the message is related to science or high-tech."
    }
  ],
  "trec": [
    {
      "idx": 11,
      "data": "what is an angelus?",
      "label": 0,
      "keywords": "what is an",
      "explanation": "This question asks the definition of an angelus, thus it belongs to questions asking for description."
    },
    {
      "idx": 24,
      "data": "what 's the largest u.s. agricultural crop by weight ?",
      "label": 1,
      "keywords": "what 's the",
      "explanation": "This question asks the largest u.s. agricultural crop by weight, the anwser should be a type of crop, thus it is asking for an entity."
    },
    {
      "idx": 71,
      "data": "who was william henry harrison ?",
      "label": 2,
      "keywords": "who",
      "explanation": "The question asks for a specific person, thus it is a question for human descriptions."
    },
    {
      "idx": 327,
      "data": "what does bud stand for ?",
      "label": 3,
      "keywords": "stand for",
      "explanation": "The question asks for the meaning of an abbreviation 'bud', thus it is a question asking for abbreviation."
    },
    {
      "idx": 32,
      "data": "where is the keck telescope ?",
      "label": 4,
      "keywords": "where is",
      "explanation": "The question asks for the location of the keck telescope, therefore the answer should be a location."
    },
    {
      "idx": 131,
      "data": "how many sonnets did shakespeare write ?",
      "label": 5,
      "keywords": "how many",
      "explanation": "This question asks for the quantity of shakespeare's sonnets, therefore the answer should be a numeric value."
    }
  ],
  "medical_abstract": [
    {
      "idx": 7,
      "data": "Elective radical neck dissection in epidermoid cancer of the head and neck. A retrospective analysis of 853 cases of mouth, pharynx, and larynx cancer. A retrospective analysis of 853 patients with cancer of the mouth, pharynx, and larynx operated on over a 30-year period was performed. Four hundred fifty-seven of them had a radical neck dissection (RND) at some point. Five hundred ninety patients had no clinically positive nodes (N-o) necks at the time of primary treatment; 99 of these had elective neck dissection, whereas 95 others had a delayed RND when nodes became clinically involved. Twenty-three percent of all N-o patients had microscopically involved nodes and less than half of these were among those patients selected for elective RND. Furthermore, 58% of those patients who had elective RND did not have positive nodes. Comparative analysis of elective RND, delayed therapeutic RND after clinical appearance of nodes, and composite operations for patients with N1-N3 disease indicates little difference in disease-free survival when the nodes in the elective RND were positive microscopically for tumors (56%, 49% and 47% respectively). It thus seems that elective RND offers no real advantage over a careful watchful waiting approach in most patients",
      "label": 0,
      "keywords": "cancer, tumors",
      "explanation": "This study investigates treatments for patients with cancer, thus it is related to neoplasms."
    },
    {
      "idx": 47,
      "data": "Ten years' experience with an elemental diet in the management of Crohn's disease. The immediate and longterm outcome of treating patients with acute Crohn's disease with an elemental diet was studied retrospectively. Successful diet induced remission was achieved in 96 of 113 patients (85%) regardless of age, sex, site or severity of disease, or associated complications of strictures, fistula, or perianal disease. Treatment was unsuccessful in 17 patients (15%), but there were no features at the outset of treatment that distinguished these patients from those who had successful remission. The longterm outcome of treatment was assessed over a five year period by analysis of life tables and survival curves. Twenty two per cent of the patients relapsed within six months of treatment and thereafter the annual relapse rate was 8-10%. Patients with disease complicated by fistula or perianal involvement had early relapse, approaching 100% for the latter. A further retrospective comparison of longterm outcome of diet v steroid induced remissions showed no significant difference in the relapse rates between the two groups at one, three, and five years.",
      "label": 1,
      "keywords": "Crohn's disease, diet",
      "explanation": "This study investigates the management of Crohn's disease with an elemental diet, so it is related to digestive system diseases."
    },
    {
      "idx": 43,
      "data": "Prognosticating study for cervical myelopathy using evoked spinal cord potentials. One hundred twenty-three cases of cervical spondylotic and ossification of the posterior longitudinal ligament (OPLL) myelopathy cases with long tract signs subjected to surgical treatment were studied to identify the most important factors having an influence on postoperative outcome using evoked spinal cord potentials (ESCP). Disappearance and positive wave changes of these potentials at the level of responsible lesions and slow conduction velocity under 40 m indicated an unsatisfactory outcome. Localized-lesion cases diagnosed by ESCPs had excellent results, significantly more so than extensive-lesion cases, regardless of operative methods. In 123 cases, 76% were found to have localized lesions, while the other 24% showed extensive lesions. Concerning the difference between CSM and OPLL, 54% of OPLL and only 14% of CSM demonstrated extensive lesions.",
      "label": 2,
      "keywords": "cervical myelopathy",
      "explanation": "This study is about cervical myelopathy, thus it is related to nervous system diseases."
    },
    {
      "idx": 11,
      "data": "Coronary ostial reconstruction: technical issues. Coronary ostial reconstruction may be the preferred alternative to reestablish antegrade myocardial revascularization in patients with isolated ostial stenosis. The technical steps of reconstruction are described. The ultrasonic aspirator is a helpful implement in the dissection of the left main and the proximal right coronary arteries. Satisfactory results of coronary ostial reconstruction in the current era seem to fulfill its promise.",
      "label": 3,
      "keywords": "coronary ostial, myocardial, ostial stenosis",
      "explanation": "The paragraph is about coronary ostial reconstruction as a solution to isolated ostial stenosis, thus it is related to cardiovascular diseases."
    },
    {
      "idx": 34,
      "data": "Acute and chronic stress in duodenal ulcer disease. Acute and chronic life event stressors were objectively assessed in a sample of duodenal ulcer patients and community controls. Stress was assessed on two dimensions, \"personal threat\" and \"goal frustration.\" Chronic stressors (those of 6 months' duration or more) involving high goal frustration were significantly and independently associated with the onset and relapse of duodenal ulcers, as were acute events of high immediate but transient personal threat.",
      "label": 4,
      "keywords": "duodenal ulcer disease",
      "explanation": "This paragraph is about duodenal ulcer disease, which does not lie in other categories."
    }
  ],
  "spouse": [
    {
      "idx": 38,
      "data": "Kerry says when Hanaki does n't want to eat his dinner the only person he will let spoon - feed him is his feisty little sister Marley - pictured left  Kerry describes finding out Hanaki has Down s as the  darkest day of my life . Are Marley and Hanaki spouses?",
      "label": 0,
      "regex": "{{A}}.{0,50}sister.{0,20}{{B}}",
      "explanation": "The sentence says Marley is Hanaki's little sister, thus they are not spouses."
    },
    {
      "idx": 6,
      "data": "Williams and Ven Veen arrived at the ranch earlier in the week , where they held a welcome party for their guests Thursday . Are Williams and Ven Veen spouses?",
      "label": 0,
      "regex": "{{A}} and {{B}}",
      "explanation": "The sentence only says Williams and Ven Veen held a welcome party together. It does not contain enough information to tell whether they are spouses."
    },
    {
      "idx": 64,
      "data": "Alana , 10 , dropped her first single , Movin  Up , on Monday  The video for the song features viral video artist Adam Barta , who also helped her to write the song  TLC reality series Here Comes Honey Boo Boo was canceled over a year ago over claims Mama June s ex molested her daughter Anna in 2002  Here Comes Honey Boo Boo has been canceled for nearly a year , but former TLC reality star Alana Thompson has already found a new focus for her energies having recently launched her music career with the debut of her new rap video . Are Movin and Anna spouses?",
      "label": 0,
      "regex": "None",
      "explanation": "The sentence tells us Movin Up is Alana's first single, therefore there is no spouse relationship between Alana and Movin."
    },
    {
      "idx": 279,
      "data": "Hunter ( left ) was killed in a tragic  accident  , a spokeswoman for his father Eddie Montgomery ( right ) said  Davara Little , his ex - fiancée and mother of his four - month - old son , posted a touching message on her Facebook page saying :  Hunter gave me the greatest gift a man can give to a woman and no matter what happened to Hunter and I and where our relationship was going , I will forever be grateful for the sweet boy we have together .  Are hunter and Eddie Montgomery spouses?",
      "label": 0,
      "regex": "{{A}}.{0,50}father.{0,20}{{B}}",
      "explanation": "The sentence says Eddie Montgomery is Hunter's father, therefore they are not spouses."
    },
    {
      "idx": 532,
      "data": "More executions this week – Two more death row inmates are scheduled to die this week On Wednesday Richard Glossip 52 faces death by lethal injection in Oklahoma for the 1997 murder of a motel owner a crime he denies committing A campaign to save him has drawn the support of a number of celebrities including actress Susan Sarandon and billionaire Richard Branson On Thursday Virginia is scheduled to put to death Alfredo Prieto a Salvadoran immigrant who was convicted of three murders and linked to six others His lawyers say he is mentally handicapped and should be spared the death penalty On Tuesday the Inter - American Human Rights Commission a body of the Organization of American States called for a stay of execution. Are Richard Glossip and Richard Branson spouses?",
      "label": 0,
      "regex": "None",
      "explanation": "The sentence does not indicate that Richard Glossip and Richard Branson are spouses."
    },
    {
      "idx": 942,
      "data": "Alexa PenaVega and Carlos PenaVega will be the first married couple to compete on a season of  Dancing with the Stars . Are Alexa PenaVega and Carlos PenaVega spouses?",
      "label": 1,
      "regex": "{{A}}.{0,20}{{B}}.{0,50}married[SEP]{{A}}.{0,20}{{B}}.{0,50}couple",
      "explanation": "The sentence says that Alexa PenaVega and Carlos PenaVega will be the first married couple, which indicate that they are spouses."
    },
    {
      "idx": 52,
      "data": "Michael Ulatowski ( pictured ) did not finalise the divorce with his wife Faith Jenkinson , but she went to marry another man ,  Andrew Asher . Are Faith Jenkinson and Andrew Asher spouses?",
      "label": 1,
      "regex": "{{A}}.{0,50}marry.{0,50}{{B}}[SEP]{{B}}.{0,50}marry.{0,50}{{A}}",
      "explanation": "The sentence claims that Faith Jenkinson marry Andrew Asher, therefore they are spouses."
    },
    {
      "idx": 67,
      "data": "A judge spared her jail  When interviewed by police with a solicitor present in March this year , Jenkinson said she was still married to Mr Ulatowski when she married Mr Asher in 2010 . Are Jenkinson and Mr Asher spouses?",
      "label": 1,
      "regex": "{{A}}.{0,50}marr(y|ied|ies).{0,50}{{B}}[SEP]{{B}}.{0,50}marr(y|ied|ies).{0,50}{{A}}",
      "explanation": "The sentence says that Jenkinson married Mr Asher in 2010, therefore they are spouses."
    },
    {
      "idx": 304,
      "data": "Kim looked like she was stifling a yawn as she browsed the store  Out and about : Kim s husband Kanye West was seen leaving his apartment in New York City on Sunday  Kylie recently shared a Snapchat video in which she is biting her 25-year - old rapper beau s lip . Are Kim and Kanye West spouses?",
      "label": 1,
      "regex": "{{A}}.{0,20}husband.{0,20}{{B}}[SEP]{{B}}.{0,20}husband.{0,20}{{A}}",
      "explanation": "The sentence says Kanye West is Kim's husband. Therefore they are spouses."
    },
    {
      "idx": 522,
      "data": "Lady Bird Johnson was born as Claudia Alta Taylor and married Lyndon B. Johnson in 1934 . Are Claudia Alta Taylor and Lyndon B. Johnson spouses?",
      "label": 1,
      "regex": "{{A}}.{0,50}marr(y|ied|ies).{0,50}{{B}}[SEP]{{B}}.{0,50}marr(y|ied|ies).{0,50}{{A}}",
      "explanation": "The sentence says Claudia Alta Taylor, also known as Lady Bird Johnson, married Lyndon B. Johnson in 1934. Therefore they are spouses."
    }
  ],
  "semeval": [
    {
      "idx": 2634,
      "data": "A girl with a mitochondrial disorder who developed a neurodegenerative disorder with '' features of autism '' after getting a fever from vaccines . What is the relationship between vaccines and fever?",
      "label": 0,
      "regex": "{{B}}.{0,50}from.{0,50}{{A}}",
      "explanation": "The sentence says the girl got a fever from vaccines, therefore the vaccines caused fever."
    },
    {
      "idx": 3078,
      "data": "This text indicates that the drawing was enclosed in a letter to Anna . What is the relationship between drawing and letter?",
      "label": 1,
      "regex": "{{A}}.{0,50}in.{0,50}{{B}}",
      "explanation": "The drawing was enclosed in a letter, thus it is a component of the letter."
    },
    {
      "idx": 6951,
      "data": "The book was in a trunk full of documents handed over to the archive . What is the relationship between book and trunk?",
      "label": 2,
      "regex": "{{A}}.{0,50}in.{0,50}{{B}}",
      "explanation": "The book was in a trunk of documents, so the trunk is the container for the book."
    },
    {
      "idx": 5364,
      "data": "We drained the liquid into the container . What is the relationship between liquid and container?",
      "label": 3,
      "regex": "{{A}}.{0,50}into.{0,50}{{B}}",
      "explanation": "The liquid was drained into the container, so the container is the destination of the liquid."
    },
    {
      "idx": 1494,
      "data": "I asked the Something Awful Forum Goons to create products from the future , and by golly they did . What is the relationship between products and future?",
      "label": 4,
      "regex": "{{A}} from {{B}}",
      "explanation": "The products come from the future, therefore the future is the origin of the products."
    },
    {
      "idx": 1214,
      "data": "This is how a politician uses tourism as an instrument for power . What is the relationship between tourism and politician?",
      "label": 5,
      "regex": "{{B}} use.{0,20}{{A}}",
      "explanation": "The politician uses tourism as an instrument, therefore the tourism is an instrument of the politician."
    },
    {
      "idx": 3385,
      "data": "The Government spent nearly 10m euro of taxpayers ' money this year to cover the salaries of the ever-increasing coterie of special advisers . What is the relationship between advisers and coterie?",
      "label": 6,
      "regex": "{{B}} of {{A}}",
      "explanation": "The coterie consists of advisers. Therefore the advisers are members of the coterie."
    },
    {
      "idx": 5778,
      "data": "Laws often refer to blade lengths and styles to define tools with useful purposes . What is the relationship between laws and lengths?",
      "label": 7,
      "regex": "{{A}}.{0,20}refer to.{0,20}{{B}}",
      "explanation": "The laws refer to blade lengths and styles, thus the lengths are topics in laws."
    },
    {
      "idx": 4192,
      "data": "This is a brilliant piece of work by a fellow not one person in the music press would ever have tipped to write one of the great Scottish albums of the last five years . What is the relationship between piece and fellow?",
      "label": 8,
      "regex": "{{A}}.{0,50}by.{0,20}{{B}}",
      "explanation": "The piece of work is done by a fellow, which means the relationship between them is product and producer."
    }
  ],
  "arxiv_abstract": [
    {
      "idx": 21377,
      "data": "A hybrid classification-regression approach for 3D hand pose estimation using graph convolutional networks\\nhand pose estimation is a crucial part of a wide range of augmented reality\\nand human-computer interaction applications. predicting the 3d hand pose from a\\nsingle rgb image is challenging due to occlusion and depth ambiguities.\\ngcn-based (graph convolutional networks) methods exploit the structural\\nrelationship similarity between graphs and hand joints to model kinematic\\ndependencies between joints. these techniques use predefined or globally\\nlearned joint relationships, which may fail to capture pose-dependent\\nconstraints. to address this problem, we propose a two-stage gcn-based\\nframework that learns per-pose relationship constraints. specifically, the\\nfirst phase quantizes the 2d/3d space to classify the joints into 2d/3d blocks\\nbased on their locality. this spatial dependency information guides this phase\\nto estimate reliable 2d and 3d poses. the second stage further improves the 3d\\nestimation through a gcn-based module that uses an adaptative nearest neighbor\\nalgorithm to determine joint relationships. extensive experiments show that our\\nmulti-stage gcn approach yields an efficient model that produces accurate 2d/3d\\nhand poses and outperforms the state-of-the-art on two public datasets.",
      "label": 0,
      "keywords": "3D, graph convolutional networks, image",
      "explanation": "This paper deal with 3D hand pose estimation, which belongs to computer vision tasks."
    },
    {
      "idx": 21389,
      "data": "Polarimetric Multi-View Inverse Rendering\\na polarization camera has great potential for 3d reconstruction since the\\nangle of polarization (aop) of reflected light is related to an object is\\nsurface normal. in this paper, we propose a novel 3d reconstruction method\\ncalled polarimetric multi-view inverse rendering (polarimetric mvir) that\\neffectively exploits geometric, photometric, and polarimetric cues extracted\\nfrom input multi-view color polarization images. we first estimate camera poses\\nand an initial 3d model by geometric reconstruction with a standard\\nstructure-from-motion and multi-view stereo pipeline. we then refine the\\ninitial model by optimizing photometric and polarimetric rendering errors using\\nmulti-view rgb and aop images, where we propose a novel polarimetric rendering\\ncost function that enables us to effectively constrain each estimated surface\\nvertex is normal while considering four possible ambiguous azimuth angles\\nrevealed from the aop measurement. experimental results using both synthetic\\nand real data demonstrate that our polarimetric mvir can reconstruct a detailed\\n3d shape without assuming a specific polarized reflection depending on the\\nmaterial.",
      "label": 0,
      "keywords": "3D, rendering",
      "explanation": "This paper deal with 3d reconstruction via Polarimetric Multi-View Inverse Rendering, thus it is related to computer vision."
    },
    {
      "idx": 21960,
      "data": "efficient Conditional Pre-training for Transfer Learning\\nalmost all the state-of-the-art neural networks for computer vision tasks are\\ntrained by (1) pre-training on a large-scale dataset and (2) finetuning on the\\ntarget dataset. this strategy helps reduce dependence on the target dataset and\\nimproves convergence rate and generalization on the target task. although\\npre-training on large-scale datasets is very useful, its foremost disadvantage\\nis high training cost. to address this, we propose efficient filtering methods\\nto select relevant subsets from the pre-training dataset. additionally, we\\ndiscover that lowering image resolutions in the pre-training step offers a\\ngreat trade-off between cost and performance. we validate our techniques by\\npre-training on imagenet in both the unsupervised and supervised settings and\\nfinetuning on a diverse collection of target datasets and tasks. our proposed\\nmethods drastically reduce pre-training cost and provide strong performance\\nboosts. finally, we improve standard imagenet pre-training by 1-3% by tuning\\navailable models on our subsets and pre-training on a dataset filtered from a\\nlarger scale dataset.",
      "label": 0,
      "keywords": "computer vision, image, imagenet",
      "explanation": "This paper propose efficient conditional pre-training method on imagenet for computer vision tasks, thus its topic is computer vision."
    },
    {
      "idx": 21785,
      "data": "Self-Similarity Based Time Warping\\nin this work, we explore the problem of aligning two time-ordered point\\nclouds which are spatially transformed and re-parameterized versions of each\\nother. this has a diverse array of applications such as cross modal time series\\nsynchronization (e.g. mocap to video) and alignment of discretized curves in\\nimages. most other works that address this problem attempt to jointly uncover a\\nspatial alignment and correspondences between the two point clouds, or to\\nderive local invariants to spatial transformations such as curvature before\\ncomputing correspondences. by contrast, we sidestep spatial alignment\\ncompletely by using self-similarity matrices (ssms) as a proxy to the\\ntime-ordered point clouds, since self-similarity matrices are blind to\\nisometries and respect global geometry. our algorithm, dubbed \"isometry blind\\ndynamic time warping\" (ibdtw), is simple and general, and we show that its\\nassociated dissimilarity measure lower bounds the l1 gromov-hausdorff distance\\nbetween the two point sets when restricted to warping paths. we also present a\\nlocal, partial alignment extension of ibdtw based on the smith waterman\\nalgorithm. this eliminates the need for tedious manual cropping of time series,\\nwhich is ordinarily necessary for global alignment algorithms to function\\nproperly.",
      "label": 0,
      "keywords": "video, images",
      "explanation": "This work explore the problem of aligning two time-ordered point clouds, focusing on applications like images and videos. Thus its topic is more close to pattern recognition and computer vision."
    },
    {
      "idx": 21871,
      "data": "Unsupervised Learning of Local Discriminative Representation for Medical Images\\nlocal discriminative representation is needed in many medical image analysis\\ntasks such as identifying sub-types of lesion or segmenting detailed components\\nof anatomical structures. however, the commonly applied supervised\\nrepresentation learning methods require a large amount of annotated data, and\\nunsupervised discriminative representation learning distinguishes different\\nimages by learning a global feature, both of which are not suitable for\\nlocalized medical image analysis tasks. in order to avoid the limitations of\\nthese two methods, we introduce local discrimination into unsupervised\\nrepresentation learning in this work. the model contains two branches: one is\\nan embedding branch which learns an embedding function to disperse dissimilar\\npixels over a low-dimensional hypersphere; and the other is a clustering branch\\nwhich learns a clustering function to classify similar pixels into the same\\ncluster. these two branches are trained simultaneously in a mutually beneficial\\npattern, and the learnt local discriminative representations are able to well\\nmeasure the similarity of local image regions. these representations can be\\ntransferred to enhance various downstream tasks. meanwhile, they can also be\\napplied to cluster anatomical structures from unlabeled medical images under\\nthe guidance of topological priors from simulation or other structures with\\nsimilar topological characteristics. the effectiveness and usefulness of the\\nproposed method are demonstrated by enhancing various downstream tasks and\\nclustering anatomical structures in retinal images and chest x-ray images.",
      "label": 0,
      "keywords": "images",
      "explanation": "This paper investigate local discriminative representation for medical images, thus its topic is more close to computer vision."
    },
    {
      "idx": 21801,
      "data": "Towards Modular Algorithm Induction\\nwe present a modular neural network architecture main that learns algorithms\\ngiven a set of input-output examples. main consists of a neural controller that\\ninteracts with a variable-length input tape and learns to compose modules\\ntogether with their corresponding argument choices. unlike previous approaches,\\nmain uses a general domain-agnostic mechanism for selection of modules and\\ntheir arguments. it uses a general input tape layout together with a parallel\\nhistory tape to indicate most recently used locations. finally, it uses a\\nmemoryless controller with a length-invariant self-attention based input tape\\nencoding to allow for random access to tape locations. the main architecture is\\ntrained end-to-end using reinforcement learning from a set of input-output\\nexamples. we evaluate main on five algorithmic tasks and show that it can learn\\npolicies that generalizes perfectly to inputs of much longer lengths than the\\nones used for training.",
      "label": 1,
      "keywords": "modular algorithm induction, domain-agnostic, reinforcement learning",
      "explanation": "This paper investigate the modular algorithm induction problem using reinforcement learning. The algorithm is domain-agnostic, so the topic is more close to general machine learning."
    },
    {
      "idx": 22482,
      "data": "Learning to Embed Categorical Features without Embedding Tables for Recommendation\\nembedding learning of categorical features (e.g. user/item ids) is at the\\ncore of various recommendation models including matrix factorization and neural\\ncollaborative filtering. the standard approach creates an embedding table where\\neach row represents a dedicated embedding vector for every unique feature\\nvalue. however, this method fails to efficiently handle high-cardinality\\nfeatures and unseen feature values (e.g. new video id) that are prevalent in\\nreal-world recommendation systems. in this paper, we propose an alternative\\nembedding framework deep hash embedding (dhe), replacing embedding tables by a\\ndeep embedding network to compute embeddings on the fly. dhe first encodes the\\nfeature value to a unique identifier vector with multiple hashing functions and\\ntransformations, and then applies a dnn to convert the identifier vector to an\\nembedding. the encoding module is deterministic, non-learnable, and free of\\nstorage, while the embedding network is updated during the training time to\\nlearn embedding generation. empirical results show that dhe achieves comparable\\nauc against the standard one-hot full embedding, with smaller model sizes. our\\nwork sheds light on the design of dnn-based alternative embedding schemes for\\ncategorical features without using embedding table lookup.",
      "label": 1,
      "keywords": "embedding learning, recommendation models",
      "explanation": "This paper proposes a deep hash embedding method to learn embeddings of categorical features. The task is not domain specific, so the paper is more close to general machine learning."
    },
    {
      "idx": 22726,
      "data": "Federated Bandit: A Gossiping Approach\\nin this paper, we study \\\\emph{federated bandit}, a decentralized multi-armed\\nbandit problem with a set of $n$ agents, who can only communicate their local\\ndata with neighbors described by a connected graph $g$. each agent makes a\\nsequence of decisions on selecting an arm from $m$ candidates, yet they only\\nhave access to local and potentially biased feedback/evaluation of the true\\nreward for each action taken. learning only locally will lead agents to\\nsub-optimal actions while converging to a no-regret strategy requires a\\ncollection of distributed data. motivated by the proposal of federated\\nlearning, we aim for a solution with which agents will never share their local\\nobservations with a central entity, and will be allowed to only share a private\\ncopy of his/her own information with their neighbors. we first propose a\\ndecentralized bandit algorithm gossip_ucb, which is a coupling of variants of\\nboth the classical gossiping algorithm and the celebrated upper confidence\\nbound (ucb) bandit algorithm. we show that gossip_ucb successfully adapts local\\nbandit learning into a global gossiping process for sharing information among\\nconnected agents, and achieves guaranteed regret at the order of $o(\\\\max\\\\{\\n\\\\texttt{poly}(n,m) \\\\log t, \\\\texttt{poly}(n,m)\\\\log_{\\\\lambda_2^{-1}} n\\\\})$ for\\nall $n$ agents, where $\\\\lambda_2\\\\in(0,1)$ is the second largest eigenvalue of\\nthe expected gossip matrix, which is a function of $g$. we then propose\\nfed_ucb, a differentially private version of gossip_ucb, in which the agents\\npreserve $\\\\epsilon$-differential privacy of their local data while achieving\\n$o(\\\\max \\\\{\\\\frac{\\\\texttt{poly}(n,m)}{\\\\epsilon}\\\\log^{2.5} t, \\\\texttt{poly}(n,m)\\n(\\\\log_{\\\\lambda_2^{-1}} n + \\\\log t) \\\\})$ regret.",
      "label": 1,
      "keywords": "bandit, multi-armed bandit, agent",
      "explanation": "This paper studies a decentralized multi-armed bandit problem and propose novel algorithms, thus it belongs to machine learning category."
    },
    {
      "idx": 23158,
      "data": "Analysis of a Random Forests Model\\nrandom forests are a scheme proposed by leo breiman in the 2000 is for\\nbuilding a predictor ensemble with a set of decision trees that grow in\\nrandomly selected subspaces of data. despite growing interest and practical\\nuse, there has been little exploration of the statistical properties of random\\nforests, and little is known about the mathematical forces driving the\\nalgorithm. in this paper, we offer an in-depth analysis of a random forests\\nmodel suggested by breiman in \\\\cite{bre04}, which is very close to the original\\nalgorithm. we show in particular that the procedure is consistent and adapts to\\nsparsity, in the sense that its rate of convergence depends only on the number\\nof strong features and not on how many noise variables are present.",
      "label": 1,
      "keywords": "random forests",
      "explanation": "this paper provides an in-depth theoretical analysis of the random forests model. It's topic is more close to machine learning theory."
    },
    {
      "idx": 23281,
      "data": "MAGNet: Multi-agent Graph Network for Deep Multi-agent Reinforcement Learning\\nover recent years, deep reinforcement learning has shown strong successes in\\ncomplex single-agent tasks, and more recently this approach has also been\\napplied to multi-agent domains. in this paper, we propose a novel approach,\\ncalled magnet, to multi-agent reinforcement learning that utilizes a relevance\\ngraph representation of the environment obtained by a self-attention mechanism,\\nand a message-generation technique. we applied our magnet approach to the\\nsynthetic predator-prey multi-agent environment and the pommerman game and the\\nresults show that it significantly outperforms state-of-the-art marl solutions,\\nincluding multi-agent deep q-networks (madqn), multi-agent deep deterministic\\npolicy gradient (maddpg), and qmix",
      "label": 1,
      "keywords": "multi-agent, reinforcement learning",
      "explanation": "This paper investigates the multi-agent reinforcement learning problem, so it belongs to the machine learning area."
    }
  ],
  "sato": [
    {
      "label": 24,
      "data": "129, Beaumont Road 129, Beaumont Road 131, Beaumont Road 133, Beaumont Road 133, Beaumont Road 133, Beaumont Road 139, Beaumont Road 139, Beaumont Road 137, Beaumont Road 40, Beaumont Road",
      "keywords": "129, 133, Beaumont",
      "explanation": "The sequence has some commonly used address keywords so the label should be address"
    },
    {
      "label": 24,
      "data": "305 S STATE 1400 15TH AVE NW",
      "keywords": "15TH, 305, 1400",
      "explanation": "The sequence has some commonly used address keywords so the label should be address"
    },
    {
      "label": 75,
      "data": "Plumbers/Pipefitters Union National Rifle Assn",
      "keywords": "Rifle, Assn, National",
      "explanation": "The sequence has some commonly used affiliate keywords so the label should be affiliate"
    },
    {
      "label": 75,
      "data": "Neetirajsinh Chhasatia http://neetirajsinh.co.in/ Yashar http://snowafter.com/ Sedna http://www.sednawireless.com/best-bluetooth-headset/ Affiliate http://www.theplasmacutter.com/best-plasma-cutter-reviews/ ANKIT JAIN http://www.auhits.com/",
      "keywords": "ANKIT, Neetirajsinh, Sedna",
      "explanation": "The sequence has some commonly used affiliate keywords so the label should be affiliate"
    },
    {
      "label": 47,
      "data": "National Democratic Institute for International Affairs International Republican Institute OPORA",
      "keywords": "National, Republican, Affairs",
      "explanation": "The sequence has some commonly used affiliation keywords so the label should be affiliation"
    },
    {
      "label": 47,
      "data": "Commission on Security and Cooperation in Europe Commission on Security and Cooperation in Europe Commission on Security and Cooperation in Europe International Republican Institute National Democratic Institute (NDI) International Foundation for Electoral Systems (IFES) Freedom House",
      "keywords": "Commission, Security, Systems",
      "explanation": "The sequence has some commonly used affiliation keywords so the label should be affiliation"
    },
    {
      "label": 3,
      "data": "0 - 3M 0 - 6M 3 - 6M 6 - 12M 1 - 2 years",
      "keywords": "6, years, 1",
      "explanation": "The sequence has some commonly used age keywords so the label should be age"
    },
    {
      "label": 3,
      "data": "0/6M 6/12M 12/24M",
      "keywords": "0/6M, 12/24M, 6/12M",
      "explanation": "The sequence has some commonly used age keywords so the label should be age"
    },
    {
      "label": 19,
      "data": "Goodbye, Babylon Superstitions Si, Para Usted: The Funky Beats of Revolutionary Cuba Antibalas Jiaolong Limerence Cosmic Sound II Sunrise Blend 2 The Flower Lane The Sun EP s/t Tender New Signs Pipe Dreams A Catholic Education Four yamane Sakura River Burning Farm Nigeria Special Volume 2: Modern Highlife, Afro-Sounds and Nigerian Blues Shadow To Shine Stranger Wasp EP Cobra Juicy Mirror Gazer Bad Penny",
      "keywords": "River, Babylon, Cobra",
      "explanation": "The sequence has some commonly used album keywords so the label should be album"
    },
    {
      "label": 19,
      "data": "Es könnte gar nicht schöner sein - Single Es könnte gar nicht schöner sein - Single Schlager Pooower!!! - Fussballhits Schlager Limonade Mallorca's Partygold Vol. 1 Mallorca's fetzige Ludermixe Vol. 2 Mallorca's Partygold Vol. 2 Illegal Schlager Vol. 3 Gleis 3 Party Express (Vol.1) Hands Up - Partykracher Vol.2",
      "keywords": "Limonade, könnte, Hands",
      "explanation": "The sequence has some commonly used album keywords so the label should be album"
    },
    {
      "label": 36,
      "data": "Fuego Ironworks Route 218 Route 221 Route 222 Route 224 Sea Route 230",
      "keywords": "222, Route, 218",
      "explanation": "The sequence has some commonly used area keywords so the label should be area"
    },
    {
      "label": 36,
      "data": "Iron Island (B1f Left) Iron Island (B1f Right) Iron Island (B2f Right) Iron Island (B2f Left) Iron Island (B3f)",
      "keywords": "B3f, B2f, Island",
      "explanation": "The sequence has some commonly used area keywords so the label should be area"
    },
    {
      "label": 15,
      "data": "Led Zeppelin Led Zeppelin Led Zeppelin Led Zeppelin Led Zeppelin Led Zeppelin Led Zeppelin Led Zeppelin Led Zeppelin",
      "keywords": "Zeppelin, Led",
      "explanation": "The sequence has some commonly used artist keywords so the label should be artist"
    },
    {
      "label": 15,
      "data": "Chuck Prophet Chuck Prophet",
      "keywords": "Prophet, Chuck",
      "explanation": "The sequence has some commonly used artist keywords so the label should be artist"
    },
    {
      "label": 63,
      "data": "December 11, 1972 November 25, 1971 September 24, 1978 January 9, 1976 August 24, 1968 March 18, 1977 October 30, 1977 September 3, 1979 June 5, 1980 April 19, 1981 February 24, 1974 November 8, 1975 January 12, 1979 February 2, 1969 January 7, 1975 March 22, 1977 January 22, 1981 July 7, 1974 July 17, 1977 September 21, 1969 April 13, 1972 February 28, 1969 July 15, 1974 June 18, 1979 August 24, 1969 March 9, 1978 December 11, 1975 August 27, 1979 June 12, 1977 March 16, 1975 February 8, 1975 September 2, 1974 April 18, 1979 May 21, 1975 February 13, 1972",
      "keywords": "27, July, August",
      "explanation": "The sequence has some commonly used birthDate keywords so the label should be birthDate"
    },
    {
      "label": 63,
      "data": "Day, Month, 1922 Day, Month, 1922 Day, Month, 1911 1901 Date, 1870 1910 Date, 1891 Day, Month, 1872 1906 1866 1886 Day, Month, 1894 Day, Month, 1930 1798 1798 1798 1790 1790 1790 Day, Month, 1840 Day, Month, 1840",
      "keywords": "1922, 1891, 1910",
      "explanation": "The sequence has some commonly used birthDate keywords so the label should be birthDate"
    },
    {
      "label": 66,
      "data": "Place Place Place Place Place Place, USA Place, USA Place, Italy Place, Italy Place, Italy Place, Italy Place Place Place Place, Italy Italy Italy Place, USA Place, USA Place, USA Place, USA Italy Place",
      "keywords": "Place, USA, Italy",
      "explanation": "The sequence has some commonly used birthPlace keywords so the label should be birthPlace"
    },
    {
      "label": 66,
      "data": "Place, PA Place, PA Place, Canada USA Place Place, Canada Place Place, England Place, England Lithuania Place, Ukraine Place, Ukraine Place Place Place Place Place Place Place Place Place",
      "keywords": "Canada, PA, Ukraine",
      "explanation": "The sequence has some commonly used birthPlace keywords so the label should be birthPlace"
    },
    {
      "label": 52,
      "data": "Model: MPN:",
      "keywords": "Model, MPN",
      "explanation": "The sequence has some commonly used brand keywords so the label should be brand"
    },
    {
      "label": 52,
      "data": "? ? ?",
      "keywords": "",
      "explanation": "The sequence has some commonly used brand keywords so the label should be brand"
    },
    {
      "label": 65,
      "data": "30 30 6 70",
      "keywords": "30, 6, 70",
      "explanation": "The sequence has some commonly used capacity keywords so the label should be capacity"
    },
    {
      "label": 65,
      "data": "95% 87% 51% 55% 52% 60% 46% 43% 60% 46% 49% 52% 55% 35% 42% 49%",
      "keywords": "35, 51, 46",
      "explanation": "The sequence has some commonly used capacity keywords so the label should be capacity"
    },
    {
      "label": 11,
      "data": "Fall Fun, Holiday, Tours Art Museums & Centers, Fall Fun, Holiday, Shopping Fall Fun, Holiday, Tours Fall Fun, Farms & Orchards Art Museums & Centers, Fall Fun",
      "keywords": "Farms, Tours, Centers",
      "explanation": "The sequence has some commonly used category keywords so the label should be category"
    },
    {
      "label": 11,
      "data": "Non-Methane Hydrocarbons Non-Methane Hydrocarbons Greenhouse Gases Greenhouse Gases Greenhouse Gases Greenhouse Gases Greenhouse Gases Non-Methane Hydrocarbons Non-Methane Hydrocarbons Non-Methane Hydrocarbons Non-Methane Hydrocarbons Greenhouse Gases Greenhouse Gases Greenhouse Gases Greenhouse Gases Greenhouse Gases",
      "keywords": "Gases, Non-Methane, Hydrocarbons",
      "explanation": "The sequence has some commonly used category keywords so the label should be category"
    },
    {
      "label": 7,
      "data": "Los Angeles Toronto New York",
      "keywords": "Angeles, York, New",
      "explanation": "The sequence has some commonly used city keywords so the label should be city"
    },
    {
      "label": 7,
      "data": "Saint Paul Florence Tacoma Marksville Saint Petersburg Melbourne Atlantic City Memphis Cadott Nashville Cadott Thackerville Calgary Pomona Twin Lakes Twin Lakes Twin Lakes Davenport Davenport Deadwood Bowmanville Bowmanville Primm Lancaster Palmer Windsor Saint Leonard Anderson Bonner Springs Lake Charles Gretna Concord Cherokee Mahnomen New Town Annapolis Fayetteville Atlantic City Nashville Snoqualmie Bossier City",
      "keywords": "Cherokee, Florence, Leonard",
      "explanation": "The sequence has some commonly used city keywords so the label should be city"
    },
    {
      "label": 21,
      "data": "IN IN IN IN IN IN IN IN IN IN",
      "keywords": "IN",
      "explanation": "The sequence has some commonly used class keywords so the label should be class"
    },
    {
      "label": 21,
      "data": "Troublemaker Shelf Desert System ex-Thug ex-Thug Scree Delinquent Delinquent Atmosphere River Ridge Boulder Delta ex-Psychopath Troublemaker Blue regimental cruiser battle-cruiser (First Class) Interstitial/Exploratory",
      "keywords": "Shelf, Scree, First",
      "explanation": "The sequence has some commonly used class keywords so the label should be class"
    },
    {
      "label": 56,
      "data": "Class II Class II",
      "keywords": "Class, II",
      "explanation": "The sequence has some commonly used classification keywords so the label should be classification"
    },
    {
      "label": 56,
      "data": "MI5 MI5 MI5 MI5 MI5 MI5 MI5 MI5 MI5 MI5 MI5 MI5 MI5 MI5 MI5",
      "keywords": "MI5",
      "explanation": "The sequence has some commonly used classification keywords so the label should be classification"
    },
    {
      "label": 14,
      "data": "ANCM VMST SDSM GAJA SDSM TOC SWIM PNA ARKM WHSC",
      "keywords": "PNA, WHSC, SDSM",
      "explanation": "The sequence has some commonly used club keywords so the label should be club"
    },
    {
      "label": 14,
      "data": "Liverpool Arsenal Manchester City Tottenham Hotspur Everton Chelsea Southampton Hull City Aston Villa Newcastle United West Bromwich Albion Cardiff City Manchester United Swansea City Norwich City Stoke City Fulham West Ham United Crystal Palace Sunderland",
      "keywords": "Everton, City, Sunderland",
      "explanation": "The sequence has some commonly used club keywords so the label should be club"
    },
    {
      "label": 13,
      "data": "AS FPAY REMI LAPS FP",
      "keywords": "AS, LAPS, FP",
      "explanation": "The sequence has some commonly used code keywords so the label should be code"
    },
    {
      "label": 13,
      "data": "FR9902 VVTS VVPT VVBM",
      "keywords": "VVTS, VVBM, VVPT",
      "explanation": "The sequence has some commonly used code keywords so the label should be code"
    },
    {
      "label": 57,
      "data": "Graphic Novel, Teen Graphic Novel, Teen Graphic Novel, Teen",
      "keywords": "Graphic, Novel, Teen",
      "explanation": "The sequence has some commonly used collection keywords so the label should be collection"
    },
    {
      "label": 57,
      "data": "Fiction, Children's Fiction, Children's Fiction, Children's Fiction, Children's Fiction, Children's",
      "keywords": "'s, Children, Fiction",
      "explanation": "The sequence has some commonly used collection keywords so the label should be collection"
    },
    {
      "label": 58,
      "data": "db+1 d+1 db+2 d+2 db+3 d+3 db+4 d+4",
      "keywords": "db+2, d+1, d+3",
      "explanation": "The sequence has some commonly used command keywords so the label should be command"
    },
    {
      "label": 58,
      "data": "Vssadmin delete shadows Vssadmin list providers Vssadmin list shadows Vssadmin list shadowstorage Vssadmin list writers Vssadmin resize shadowstorage Vssadmin list volumes",
      "keywords": "volumes, Vssadmin, shadowstorage",
      "explanation": "The sequence has some commonly used command keywords so the label should be command"
    },
    {
      "label": 20,
      "data": "NTT DOCOMO… VANGUARD NA… TALLGRASS E… NISSAN ADR TEEKAY CORP…",
      "keywords": "CORP…, E…, TEEKAY",
      "explanation": "The sequence has some commonly used company keywords so the label should be company"
    },
    {
      "label": 20,
      "data": "Bank of America Corp... Facebook Inc Ford Motor Co Pfizer Inc AT&T Inc",
      "keywords": "Co, AT, Pfizer",
      "explanation": "The sequence has some commonly used company keywords so the label should be company"
    },
    {
      "label": 49,
      "data": "Phones System Peripheral Gateway (PG) Deployments",
      "keywords": "Phones, System, PG",
      "explanation": "The sequence has some commonly used component keywords so the label should be component"
    },
    {
      "label": 49,
      "data": "Code Documentation User interface Miscellaneous",
      "keywords": "interface, Documentation, User",
      "explanation": "The sequence has some commonly used component keywords so the label should be component"
    },
    {
      "label": 76,
      "data": "AS EU EU EU EU AS EU EU EU EU",
      "keywords": "EU, AS",
      "explanation": "The sequence has some commonly used continent keywords so the label should be continent"
    },
    {
      "label": 76,
      "data": "EU EU EU EU EU EU EU EU EU EU EU EU AS AS EU AS EU AS EU EU EU",
      "keywords": "AS, EU",
      "explanation": "The sequence has some commonly used continent keywords so the label should be continent"
    },
    {
      "label": 18,
      "data": "(GEOCODE,CODEDESC,NUMFACT,TEXT,FIELDDESC) Insert into FACTBOOK.RO_2092 (GEOCODE,CODEDESC,NUMFACT,TEXT,FIELDDESC) values ('BK','Bosnia and Herzegovina',' -0.80','2014 est.','Inflation rate (consumer prices)');",
      "keywords": "rate, prices, '2014",
      "explanation": "The sequence has some commonly used country keywords so the label should be country"
    },
    {
      "label": 18,
      "data": "England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England England",
      "keywords": "England",
      "explanation": "The sequence has some commonly used country keywords so the label should be country"
    },
    {
      "label": 27,
      "data": "FLOYD FLOYD FLOYD FLOYD",
      "keywords": "FLOYD",
      "explanation": "The sequence has some commonly used county keywords so the label should be county"
    },
    {
      "label": 27,
      "data": "Putnam DeKalb Davidson Wilson Warren Shelby Jefferson Hamilton Jefferson Davidson Lincoln Shelby Davidson Giles Shelby White Hamilton Shelby Roane Davidson Shelby Weakley Hamilton Madison Davidson Shelby Wilson Madison Gibson Davidson Tipton Putnam Shelby Shelby Clay Davidson Montgomery Rutherford Hamilton Lincoln Lincoln Washington Shelby Carroll Davidson Carroll Hamblen Hamilton Haywood Shelby",
      "keywords": "Jefferson, Hamblen, Putnam",
      "explanation": "The sequence has some commonly used county keywords so the label should be county"
    },
    {
      "label": 67,
      "data": "Ask me for a photo",
      "keywords": "me, Ask, a",
      "explanation": "The sequence has some commonly used creator keywords so the label should be creator"
    },
    {
      "label": 67,
      "data": "Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Maria Mergel Maria Mergel Steven Gilbert Steven Gilbert Maria Mergel Maria Mergel Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert Steven Gilbert",
      "keywords": "Steven, Gilbert, Mergel",
      "explanation": "The sequence has some commonly used creator keywords so the label should be creator"
    },
    {
      "label": 53,
      "data": "Insp. Johnson Solicitor Alfred Naden Leonard Evans",
      "keywords": "Alfred, Johnson, Insp",
      "explanation": "The sequence has some commonly used credit keywords so the label should be credit"
    },
    {
      "label": 53,
      "data": "Actor Actor Woman with Purple Wig Actor Administrator's Wife Aunt Olga Lady with Dog Countess Baranova Actor",
      "keywords": "Baranova, 's, Woman",
      "explanation": "The sequence has some commonly used credit keywords so the label should be credit"
    },
    {
      "label": 61,
      "data": "CAD USD",
      "keywords": "CAD, USD",
      "explanation": "The sequence has some commonly used currency keywords so the label should be currency"
    },
    {
      "label": 61,
      "data": "QAR SAR AED BHD KWD GBP CHF JPY GOLD SILVER",
      "keywords": "BHD, AED, SILVER",
      "explanation": "The sequence has some commonly used currency keywords so the label should be currency"
    },
    {
      "label": 28,
      "data": "Tuesday Tuesday Wednesday Wednesday Thursday Thursday Friday Friday Monday Monday",
      "keywords": "Tuesday, Monday, Wednesday",
      "explanation": "The sequence has some commonly used day keywords so the label should be day"
    },
    {
      "label": 28,
      "data": "Saturday Wednesday Tuesday Monday",
      "keywords": "Saturday, Wednesday, Tuesday",
      "explanation": "The sequence has some commonly used day keywords so the label should be day"
    },
    {
      "label": 55,
      "data": "3-4ft 3-4ft 4-5ft",
      "keywords": "4-5ft, 3-4ft",
      "explanation": "The sequence has some commonly used depth keywords so the label should be depth"
    },
    {
      "label": 55,
      "data": "62.1 63.0 62.4 62.4 62.6 62.3 62.9 62.4 62.8 62.9 62.5 62.7 62.8 62.5 62.9",
      "keywords": "62.3, 62.7, 62.5",
      "explanation": "The sequence has some commonly used depth keywords so the label should be depth"
    },
    {
      "label": 1,
      "data": "Year of fee payment: 4 Year of fee payment: 8 Year of fee payment: 12",
      "keywords": "4, payment, 12",
      "explanation": "The sequence has some commonly used description keywords so the label should be description"
    },
    {
      "label": 1,
      "data": "BioAcoustic Infill Panel (Black - Matte) Clear Hold Down Clip Support Hanger",
      "keywords": "Matte, Infill, Black",
      "explanation": "The sequence has some commonly used description keywords so the label should be description"
    },
    {
      "label": 73,
      "data": "Manirathnam Jone Amrthraj Dharani Ramana Sumathy Ram Aarthi Kumar Shaji Kailas Perarasu Rama Narayanan Selva Jeppi A.Y Susi Ganesan Tarun Gopi Sharadha Ramanathan Saravana Sakthi Siddhique Shaji Kailas Kiccha Prabhu Deva Chakri Toleti",
      "keywords": "Sharadha, A.Y, Rama",
      "explanation": "The sequence has some commonly used director keywords so the label should be director"
    },
    {
      "label": 73,
      "data": "Patric Ullaeus \"11 FRAMES PRODUCTIONS\" \"11 FRAMES PRODUCTIONS\" \"11 FRAMES PRODUCTIONS\"",
      "keywords": "Ullaeus, Patric, ''",
      "explanation": "The sequence has some commonly used director keywords so the label should be director"
    },
    {
      "label": 25,
      "data": "199.0 222.0 285.0 182.0 216.0 217.0 143.0 266.0 133.0 170.0 170.0 268.0 261.0 237.0 210.0 289.0 392.0 229.0 286.0 151.0",
      "keywords": "210.0, 222.0, 216.0",
      "explanation": "The sequence has some commonly used duration keywords so the label should be duration"
    },
    {
      "label": 25,
      "data": "3-5 working days, M-F only. Next working day on all orders placed before 1pm, M-F only. Saturday only on orders placed before Friday 1pm Click here for International Delivery Terms for overseas shipping.",
      "keywords": "working, here, Click",
      "explanation": "The sequence has some commonly used duration keywords so the label should be duration"
    },
    {
      "label": 70,
      "data": "Counselor Education/School Counseling and Guidance Services Educational Leadership and Administration, General Elementary Education and Teaching Health Teacher Education Physical Education Teaching and Coaching Reading Teacher Education Secondary Education and Teaching Special Education and Teaching, General",
      "keywords": "Education, Teaching, and",
      "explanation": "The sequence has some commonly used education keywords so the label should be education"
    },
    {
      "label": 70,
      "data": "Pre-school Primary - Government Primary - Catholic Primary - Other Non Government Secondary - Government Secondary - Catholic Secondary - Other Non Government Technical or further education institution University or tertiary institution Other Not Stated Total",
      "keywords": "Technical, education, Other",
      "explanation": "The sequence has some commonly used education keywords so the label should be education"
    },
    {
      "label": 46,
      "data": "232.0 0.0",
      "keywords": "0.0, 232.0",
      "explanation": "The sequence has some commonly used elevation keywords so the label should be elevation"
    },
    {
      "label": 46,
      "data": "227.0 0.0",
      "keywords": "0.0, 227.0",
      "explanation": "The sequence has some commonly used elevation keywords so the label should be elevation"
    },
    {
      "label": 54,
      "data": "unix windows",
      "keywords": "unix, windows",
      "explanation": "The sequence has some commonly used family keywords so the label should be family"
    },
    {
      "label": 54,
      "data": "19 400 47 11 59 106 299 12 291 299 360 103 33 295 69 102 331 333 121 333 8 115 326 64 186 10 224 194 72 184 73 229 230 254 170 155 73 64 118 215 224 143 46 174 148 131 12 182 132 255 39 277 180 86 12 10 133 32 28 66 75 163 181 170 164 40 9 134 285 18 118 46 26 23 50 77 50 117 24 225 114 316 119 321 321 141 71 9 70 76 27 67 44 166 179 88 115 132 116 99 120 62 62 28 150 165 264 42 62 150 121 4 90 150 291 40 291 159 156 205 240 4 108 187 96 121 108 293 277 158 26 174 128 28 2 127 1 360 219 232 182 379 58 76 180 278 230 103 46 228 16 253 349 133 104 265 16 136 263 1 272 325 64 190 144 264 3 30 230 103 181 249 250 103 92 157 168 156 162 105 46 6 320 4 173 83 110 102 121 95 110 176 298 174 185 297 173 171 128 295 375 190 156 363 212 288 179 196 154 132 131 51 100 33 66 38 123 51 96 112 5 38 318 31 65 96 190 129 189 190 269 227 213 316 304 214 13 26 222 143 248 208 114 364 23 288 17 75 89 108 40 176 85 130 72 82 84 83 33 222 1 217 74 88 114 86 155 102 42 144 252 16 79 223 37 289 113 80 56 23 23 254 242 197 168 300 219 255 129 171 150 279 235 240 105 291 105 105 123 63 360 284 248 25 41 149 277 148 239 68 170 152 166 263 91 235 212 151 12 167 14 30 222 45 118 163 312 8 294 117 93 157 336 158 355 39 16 258 351 360 287 281 286 130 44 304 218 44 38 352 282 270 45 192 40 2 159 224 124 155 192 14 182 41 57 169 37 55 89 248 185 140 157 158 115 260 255 72 133 43 231 254 155 110 204 288 211 242 360 163 120 119 27 43 360 218 324 173 267 276 258 261 260 82 81 203 301 162 399 194 220 194 300 41 194 298 68 295 242 354 55 58 119 368 36 164 133 185 75 60 49 144 21 127 76 56 41 148 21 82 127 161 205 18 244 161 307 272 283 285 169 284 255 250 328 341 122 334 245 201 201 179 51 189 279 8 189 144 177 11 108 193 174 172 307 82 235 313 149 306 299 205 231 83 140 73 15 29 31 30 1 90 299 277",
      "keywords": "45, 70, 110",
      "explanation": "The sequence has some commonly used family keywords so the label should be family"
    },
    {
      "label": 40,
      "data": "925 10K",
      "keywords": "925, 10K",
      "explanation": "The sequence has some commonly used fileSize keywords so the label should be fileSize"
    },
    {
      "label": 40,
      "data": "739,840 739,840 739,840 739,840 802,304 805,376 805,376 805,376 1,074,176 1,076,736 1,076,736 1,076,736",
      "keywords": "739,840, 1,074,176, 1,076,736",
      "explanation": "The sequence has some commonly used fileSize keywords so the label should be fileSize"
    },
    {
      "label": 26,
      "data": "Postscript PDF",
      "keywords": "PDF, Postscript",
      "explanation": "The sequence has some commonly used format keywords so the label should be format"
    },
    {
      "label": 26,
      "data": "Custom 13.5'' x 13.5'' Custom 16.5\" x 16.5\" Custom 16.5\" x 16.5\" Custom 16.5\" x 16.5\" Custom 16.5\" x 16.5\" Custom 14.2\" x 15\" Custom 14.2\" x 15\" SSI CEB (12\" X 10.5\") SSI CEB 12\" X 10.5\"",
      "keywords": "12, x, ''",
      "explanation": "The sequence has some commonly used format keywords so the label should be format"
    },
    {
      "label": 29,
      "data": "Male Male Female Female Female",
      "keywords": "Male, Female",
      "explanation": "The sequence has some commonly used gender keywords so the label should be gender"
    },
    {
      "label": 29,
      "data": "Co-ed Co-ed",
      "keywords": "Co-ed",
      "explanation": "The sequence has some commonly used gender keywords so the label should be gender"
    },
    {
      "label": 50,
      "data": "Public Safety Public Safety",
      "keywords": "Safety, Public",
      "explanation": "The sequence has some commonly used genre keywords so the label should be genre"
    },
    {
      "label": 50,
      "data": "Record Size: Duration:",
      "keywords": "Record, Size, Duration",
      "explanation": "The sequence has some commonly used genre keywords so the label should be genre"
    },
    {
      "label": 41,
      "data": "9-12 PRESCHOOL-4 5-8 PRESCHOOL-4",
      "keywords": "9-12, PRESCHOOL-4, 5-8",
      "explanation": "The sequence has some commonly used grades keywords so the label should be grades"
    },
    {
      "label": 41,
      "data": "09 - 12 08 - 12 09 - 12 08 - 12 08 - 12 09 - 12 09 - 12 09 - 12 08 - 12 09 - 12 09 - 12 09 - 12",
      "keywords": "12, 09, 08",
      "explanation": "The sequence has some commonly used grades keywords so the label should be grades"
    },
    {
      "label": 30,
      "data": "Health Professionals Pharmaceuticals/Health Products Retired Real Estate Electric Utilities",
      "keywords": "Estate, Real, Retired",
      "explanation": "The sequence has some commonly used industry keywords so the label should be industry"
    },
    {
      "label": 30,
      "data": "Legal Services Other Investment Pools and Funds State Government (OES Designation) Local Government (OES Designation) Insurance Carriers",
      "keywords": "Local, OES, Services",
      "explanation": "The sequence has some commonly used industry keywords so the label should be industry"
    },
    {
      "label": 39,
      "data": "isbn 1564149552 isbn 1600962122 isbn 0704346966 isbn 0486419223 isbn 0060851139",
      "keywords": "0060851139, 0486419223, isbn",
      "explanation": "The sequence has some commonly used isbn keywords so the label should be isbn"
    },
    {
      "label": 39,
      "data": "isbn 0765334321 isbn 0356500764 isbn 0345338588 isbn 1841498815 isbn 0553804677 isbn isbn isbn isbn 1429915439 isbn 0756407680 isbn 1433293188 isbn 0440174643 isbn 0765315432 isbn 0451458885 isbn 1401303382 isbn 0380813815 isbn 0739384252 isbn 1480527335 isbn 0441102670 isbn 1439148503 isbn 0312539517 isbn 0307347974 isbn 0618858679 isbn 0441013813 isbn 0679745580 isbn 0451933028 isbn 1416971734 isbn 0765309416 isbn 1843549182 isbn 034549749X",
      "keywords": "0312539517, 0679745580, 0756407680",
      "explanation": "The sequence has some commonly used isbn keywords so the label should be isbn"
    },
    {
      "label": 33,
      "data": "Taylor Rice (5) Jose Ortiz Manuel Franco Michael Luzzi Rosario Montanez Irad Ortiz Jr",
      "keywords": "Jr, Rice, Irad",
      "explanation": "The sequence has some commonly used jockey keywords so the label should be jockey"
    },
    {
      "label": 33,
      "data": "Gary Boulanger Ricardo Feliciano Erick Rodriguez Quincy Hamilton Antonio Gallardo",
      "keywords": "Gary, Gallardo, Boulanger",
      "explanation": "The sequence has some commonly used jockey keywords so the label should be jockey"
    },
    {
      "label": 35,
      "data": "English German Arabic",
      "keywords": "English, Arabic, German",
      "explanation": "The sequence has some commonly used language keywords so the label should be language"
    },
    {
      "label": 35,
      "data": "Japanese English French German Italian Spanish Korean Chinese (Mandarin",
      "keywords": "Spanish, Japanese, Mandarin",
      "explanation": "The sequence has some commonly used language keywords so the label should be language"
    },
    {
      "label": 5,
      "data": "Armory Sports Center Armory Sports Center",
      "keywords": "Armory, Sports, Center",
      "explanation": "The sequence has some commonly used location keywords so the label should be location"
    },
    {
      "label": 5,
      "data": "Troy, Michigan, United States De Pere, Wisconsin, United States Guadalupe Zacatecas, Mexico Lakewood, Colorado, United States Twinsburg Baton Rouge, Louisiana, United States Indianapolis Pittsburgh Albuquerque, New Mexico, United States Dayton, Ohio, United States Murray, Utah, United States Mandeville, Louisiana, United States Union City, Pennsylvania, United States Chicago, Illinois, United States Hampton, Virginia, United States Batesville, Mississippi, United States Utica, New York, United States Arcadia, California, United States Deerfield Beach, Florida, United States El Segundo Morgantown, West Virginia, United States Houston, Texas, United States Houston, Texas, United States Calabasas, California, United States N. Bellmore, New York, United States",
      "keywords": "Louisiana, United, Pennsylvania",
      "explanation": "The sequence has some commonly used location keywords so the label should be location"
    },
    {
      "label": 51,
      "data": "DUPLI COLOR MAGNETI MARELLI MOTIP MOTIP OE",
      "keywords": "MAGNETI, DUPLI, MOTIP",
      "explanation": "The sequence has some commonly used manufacturer keywords so the label should be manufacturer"
    },
    {
      "label": 51,
      "data": "BMW BMW BMW BMW BMW BMW BMW BMW",
      "keywords": "BMW",
      "explanation": "The sequence has some commonly used manufacturer keywords so the label should be manufacturer"
    },
    {
      "label": 0,
      "data": "Acer glabrum var. glabrum \"New Mexico maple\" Acer negundo \"boxelder\" Arabidopsis thaliana \"mouseear cress\" Atriplex patula \"spear saltbush\" Betula occidentalis \"water birch\" Betula occidentalis \"water birch\" Celtis reticulata Clematis occidentalis \"purple virgins-bower\" Clematis orientalis \"Oriental virgins-bower\" Clematis orientalis \"Oriental virgins-bower\" Clematis orientalis \"Oriental virgins-bower\" Convolvulus arvensis \"field bindweed\" Cornus sericea \"redosier dogwood\" Cornus sericea \"redosier dogwood\" Cornus sericea \"redosier dogwood\" Cornus sericea \"redosier dogwood\" Crataegus douglasii var. rivularis Cynoglossum officinale \"gypsyflower\" Geranium viscosissimum var. incisum \"sticky purple geranium\" Humulus lupulus \"common hop\" Humulus lupulus \"common hop\" Humulus lupulus \"common hop\" Humulus lupulus \"common hop\" Linaria dalmatica \"Dalmatian toadflax\" Lonicera involucrata var. involucrata \"twinberry honeysuckle\" Mahonia repens \"Oregongrape\" Penstemon eatonii var. eatonii Penstemon palmeri var. palmeri \"Palmer's beardtongue\" Perityle stansburyi \"Stansbury's rockdaisy\" Physocarpus alternans \"dwarf ninebark\" Physocarpus alternans \"dwarf ninebark\" Physocarpus monogynus \"mountain ninebark\" Picea pungens \"Colorado blue spruce\" Picea pungens \"Colorado blue spruce\" Populus angustifolia \"narrow-leaf cottonwood\" Populus tremuloides \"quaking aspen\" Prunus virginiana \"chokecherry\" Prunus virginiana \"chokecherry\" Rhus aromatica var. trilobata \"skunkbush sumac\" Rhus aromatica var. trilobata \"skunkbush sumac\" Ribes cereum \"wax currant\" Rosa woodsii \"Woods' rose\" Rosa woodsii \"Woods' rose\" Salix exigua \"narrow-leaf willow\" Salix x fragilis hybrid [alba x euxina] Sambucus caerulea Sambucus caerulea Sanguisorba minor \"small burnet\" Setaria pumila subsp. pumila \"yellow foxtail\" Solanum dulcamara \"climbing nightshade\" Sphaeralcea munroana \"Munroe's globemallow\"",
      "keywords": "gypsyflower, spruce, tremuloides",
      "explanation": "The sequence has some commonly used name keywords so the label should be name"
    },
    {
      "label": 0,
      "data": "n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12) n-pentane (n-C5H12)",
      "keywords": "n-pentane, n-C5H12",
      "explanation": "The sequence has some commonly used name keywords so the label should be name"
    },
    {
      "label": 60,
      "data": "Canada United States United States Canada Canada",
      "keywords": "United, Canada, States",
      "explanation": "The sequence has some commonly used nationality keywords so the label should be nationality"
    },
    {
      "label": 60,
      "data": "German Spanish Australian British Finnish German French Brazilian British German Mexican British German Australian French Mexican Finnish Venezuelan French French Finnish Dutch British",
      "keywords": "Mexican, Australian, Spanish",
      "explanation": "The sequence has some commonly used nationality keywords so the label should be nationality"
    },
    {
      "label": 23,
      "data": "(see note 1)",
      "keywords": "see, note, 1",
      "explanation": "The sequence has some commonly used notes keywords so the label should be notes"
    },
    {
      "label": 23,
      "data": "notes Notes are private! notes Notes are private! notes Notes are private! notes Notes are private! notes Notes are private! notes Notes are private!",
      "keywords": "are, Notes, notes",
      "explanation": "The sequence has some commonly used notes keywords so the label should be notes"
    },
    {
      "label": 68,
      "data": "Transportadora Julio Simões Continental Express Caribbean Aviation Air Midwest, opf. US Airways Express THY Horizon Air TANS Harbour Air Pelita Air Service Siam Air Sports Denim Air, opf. Air Nostrum TAME Ecuador Tiramavia, opf. Aerocom SAVE American Eagle Airlines Northwest Airlines Northwest Airlines Air Algérie ERA Aviation Star Air African Commuter Services Sichuan Airlines FedEx, opf. Baron Aviation VASP Bearskin Airlines Euro Asia Aviation Alaska Airlines Air China THY Enimex One Leasing Belgian AF Iranian Revolutionary Guard STAR Aviation Pakistan AF Air France Airwork NZ Borki Air Club Bering Air Wright Stuff Air Algérie Air Industria, opf. Minerva Airlines Mountain Air Cargo, opf. FedEx Rossair Contracts, opf. Red Cross Singapore Airlines Xiamen Airlines US Navy Dancing Wind Aviation Aerotaxi Ashanti Gold Fields TransAsia Airways Táxi Aéreo Pinhal One Leasing Spanish AF RAM Air Regional THY Cubana 748 Air Services FS Corsair Inc Iraq AF US Army Ibiza Flights Grand Aire Express Grand Aire Express SkyWay Enterprises Uzbekistan Airways Zapolyarye Airlines private Superior Aviation Trans Intair Empire Airlines, opf. FedEx Wetrafa Biman Bangladesh Transwest Air Unknown Sudan AF Sino Swearingen Air Regional Dniproavia Avirex Colombian Police Ukrainian Cargo Airways, opf. D.R. Congo AF Professional Maintenance Services, opf. D.R. Congo Government Uzbekistan Airways Pecotox Air Blue Line DK&L Comp. Royal Flying Doctor Service private Angolan AF Polyarnye Avialinii Oso-Rio LLC Japanese Navy Whiteshell Air Service Southwest Airlines UM Air Showa Air AW Aerowest Impulse Airlines, opf. QantasLink/Impulse",
      "keywords": "Belgian, Minerva, Wetrafa",
      "explanation": "The sequence has some commonly used operator keywords so the label should be operator"
    },
    {
      "label": 68,
      "data": "Cast (SSIS Expression): Convert SSIS Data Types () (Parentheses) (SSIS Expression) + (Add) (SSIS Expression) + (Concatenate) (SSIS Expression) - (Subtract) (SSIS Expression) - (Negate) (SSIS Expression) * (Multiply) (SSIS Expression) / (Divide) (SSIS Expression) % (Modulo) (SSIS Expression) || (Logical OR) (SSIS Expression) && (Logical AND) (SSIS Expression) ! (Logical Not) (SSIS Expression) | (Bitwise Inclusive OR) (SSIS Expression) ^ (Bitwise Exclusive OR) (SSIS Expression) & (Bitwise AND) (SSIS Expression) ~ (Bitwise Not) (SSIS Expression) == (Equal) (SSIS Expression) != (Unequal) (SSIS Expression) > (Greater Than) (SSIS Expression) < (Less Than) (SSIS Expression) >= (Greater Than or Equal To) (SSIS Expression) <= (Less Than or Equal To) (SSIS Expression) ? : (Conditional) (SSIS Expression)",
      "keywords": "SSIS, Bitwise, or",
      "explanation": "The sequence has some commonly used operator keywords so the label should be operator"
    },
    {
      "label": 44,
      "data": "Mon Tues Wed Thurs Fri Sat Sun",
      "keywords": "Sat, Mon, Thurs",
      "explanation": "The sequence has some commonly used order keywords so the label should be order"
    },
    {
      "label": 44,
      "data": "1 2 3 4 5 6 7 8 9 10 11",
      "keywords": "9, 3, 7",
      "explanation": "The sequence has some commonly used order keywords so the label should be order"
    },
    {
      "label": 77,
      "data": "umich.edu comcast.net ameritech.net 152.160 archive.org digitalrealm.net 141.211 aol.com googlebot.com 63.103 teoma.com 141.217 rr.com fastsearch.net 198.248 inktomisearch.com leapfrogbroadband.net looksmart.com comcastbusiness.net megapath.net [not listed: 66 organisations]",
      "keywords": "141.217, 63.103, listed",
      "explanation": "The sequence has some commonly used organisation keywords so the label should be organisation"
    },
    {
      "label": 77,
      "data": "wcbn.org comcast.net inktomisearch.com umich.edu 141.211 152.160 rr.com sbcglobal.net ameritech.net googlebot.com verizon.net charter.com cox.net aol.com tds.net 142.131 covad.net bellsouth.net rima-tde.net pacbell.net [not listed: 2,654 organisations]",
      "keywords": "listed, inktomisearch.com, aol.com",
      "explanation": "The sequence has some commonly used organisation keywords so the label should be organisation"
    },
    {
      "label": 45,
      "data": "Brazil Paraguay",
      "keywords": "Paraguay, Brazil",
      "explanation": "The sequence has some commonly used origin keywords so the label should be origin"
    },
    {
      "label": 45,
      "data": "Brazil Germany United States United Kingdom Europe Anonymous Proxy China",
      "keywords": "China, Europe, Proxy",
      "explanation": "The sequence has some commonly used origin keywords so the label should be origin"
    },
    {
      "label": 48,
      "data": "Mrs P Wainwright Mr K A Munnings + Miss S A Clark Mr E R Hemming Mr T Burling Mr J A Needham",
      "keywords": "E, Munnings, K",
      "explanation": "The sequence has some commonly used owner keywords so the label should be owner"
    },
    {
      "label": 48,
      "data": "ryan52, kaare, chorny bowtie azawawi mj41 bowtie szabgab azawawi jquelin, azawawi szabgab garu, azawawi Alias Alias Alias zenog submersible_toaster submersible_toaster jquelin, azawawi azawawi Alias submersible_toaster chorny bowtie azawawi szabgab Alias szabgab Alias, szabgab, Sewi, waxhead garu fayland, azawawi code4pay zenogantner garu ryan52 azawawi szabgab szabgab szabgab garu szabgab sewi azawawi azawawi azawawi azawawi azawawi azawawi azawawi azawawi bowtie bowtie garu garu garu garu garu garu claudio szabgab, azawawi, Alias azawawi",
      "keywords": "fayland, szabgab, code4pay",
      "explanation": "The sequence has some commonly used owner keywords so the label should be owner"
    },
    {
      "label": 71,
      "data": "1st 2nd 3rd",
      "keywords": "2nd, 1st, 3rd",
      "explanation": "The sequence has some commonly used person keywords so the label should be person"
    },
    {
      "label": 71,
      "data": "Ù†Ø³Ø±ÛŒÙ† Ø³ØªÙˆØ¯Ù‡: Ø²Ù†Ø¯Ø§Ù†ÛŒ Ø±ÙˆØ² Saeed Malekpour: Prisoner of the day Majid Tavakoli: Prisoner of the day Ø§Ø­Ø³Ø§Ù† Ù†Ø±Ø§Ù‚ÛŒ: Ø¬Ø§Ù…Ø¹Ù‡ Ø´Ù†Ø§Ø³ Ùˆ Ù†ÙˆÛŒØ³Ù†Ø¯Ù‡ Û±Û³Û°Ûµ-Û±Û³Û¹Û± Nasrin Sotoudeh: Prisoner of the day Nasrin Sotoudeh: Graffiti Ú¯ÙˆÙ‡Ø± Ø¹Ø´Ù‚ÛŒ: Ù…Ø§Ø¯Ø± Ø³ØªØ§Ø± Ø¨Ù‡Ø´ØªÛŒ Abdollah Momeni: Prisoner of the day Ù…Ø­Ù…Ø¯ Ú©Ù„Ø§Ù„ÛŒ: ÛŒÚ©ÛŒ Ø§Ø² Ø­Ù…Ù„Ù‡ Ú©Ù†Ù†Ø¯Ú¯Ø§Ù† Ø¨Ù‡ Ø³Ù?Ø§Ø±Øª Ø§ÛŒØ±Ø§Ù† Ø¯Ø± Ø¨Ø±Ù„ÛŒÙ† Habibollah Golparipour: Prisoner of the day",
      "keywords": "Ùˆ, the, Ø³ØªÙˆØ¯Ù‡",
      "explanation": "The sequence has some commonly used person keywords so the label should be person"
    },
    {
      "label": 43,
      "data": "52 28 108",
      "keywords": "52, 108, 28",
      "explanation": "The sequence has some commonly used plays keywords so the label should be plays"
    },
    {
      "label": 43,
      "data": "5 0 5 2 3 4 1 0 5 5 0 3 2 1 4 1 2 2 0",
      "keywords": "1, 2, 3",
      "explanation": "The sequence has some commonly used plays keywords so the label should be plays"
    },
    {
      "label": 17,
      "data": "1 – 381 1 – 1 2 – 381",
      "keywords": "2, –, 1",
      "explanation": "The sequence has some commonly used position keywords so the label should be position"
    },
    {
      "label": 17,
      "data": "D LW D D RW D LW RW LW RW",
      "keywords": "RW, LW, D",
      "explanation": "The sequence has some commonly used position keywords so the label should be position"
    },
    {
      "label": 32,
      "data": "WheyFit Protein Creamy Vanilla WheyFit Protein Dutch Chocolate WheyFit Protein Strawberry Swirl WheyFit Protein Natural Vanilla WheyFit Protein Natural Chocolate WheyFit Protein Creamy Vanilla WheyFit Protein Dutch Chocolate WheyFit Protein Chocolate Peanut Butter WheyFit Protein Strawberry Swirl WheyFit Protein Natural Vanilla WheyFit Protein Natural Chocolate WheyFit Protein Creamy Vanilla WheyFit Protein Dutch Chocolate WheyFit Protein Chocolate Peanut Butter WheyFit Protein Strawberry Swirl WheyFit Protein Natural Vanilla WheyFit Protein Natural Chocolate",
      "keywords": "Natural, Dutch, Creamy",
      "explanation": "The sequence has some commonly used product keywords so the label should be product"
    },
    {
      "label": 32,
      "data": "Omega-3 Lemon Omega-3 Lemon Omega-3 Lemon",
      "keywords": "Omega-3, Lemon",
      "explanation": "The sequence has some commonly used product keywords so the label should be product"
    },
    {
      "label": 42,
      "data": "Success Enterbrain Namco Square Enix Square Enix Bandai Bandai Gust Nintendo Capcom Nintendo",
      "keywords": "Gust, Enix, Enterbrain",
      "explanation": "The sequence has some commonly used publisher keywords so the label should be publisher"
    },
    {
      "label": 42,
      "data": "Joindots GmbH Deep Silver Squaresoft Avanquest Software SEGA XSEED Games XSEED Games Gameloft SEGA SEGA Data East Bigben Interactive Capcom WayForward WayForward WayForward Tik Games LLC Focus Home Intera... Aksys Games Atlus Atlus Atlus SEGA SEGA SEGA SEGA SEGA SEGA SEGA Yacht Club Games Yacht Club Games 2K Games G-mode Mojo Bones G-mode Konami Electronic Arts Electronic Arts Electronic Arts Nintendo Electronic Arts Electronic Arts Hudson Engine Software Engine Software Engine Software Engine Software Nintendo Teyon SEGA Namco Activision Nintendo Smileboom Chillingo Ltd. 505 Games EnjoyUp Games Cinemax Cinemax Hudson GameOn Tecmo Tecmo Tecmo Tecmo SEGA SEGA SEGA SEGA SEGA SEGA SEGA SEGA SEGA SEGA SEGA SEGA SEGA SEGA SEGA SEGA SEGA SEGA SEGA SEGA SEGA SEGA SEGA SEGA SEGA SEGA Enix Eidos Gameloft Digital Leisure SEGA SEGA SEGA Square Enix Square Enix Springloaded Take Two Virtual Toys Nintendo Nintendo Disney Interactiv... Nintendo Gamelion Studios Gamelion Studios Tozai Games Tozai Games Tozai Games Activision Activision Activision Activision Activision Activision Nintendo Nintendo Nintendo Bandai Namco (2) Bandai Namco (2) THQ Electronic Arts Electronic Arts Enjoy Gaming Nintendo EnjoyUp Games Capcom The Game Bakers The Game Bakers Tecmo Nintendo Nintendo Hudson Hudson Hudson Bethesda Softworks LucasArts Zen Studios LucasArts Nintendo LucasArts Nintendo Nintendo Curve Digital Image & Form Image & Form Image & Form",
      "keywords": "Eidos, Electronic, Mojo",
      "explanation": "The sequence has some commonly used publisher keywords so the label should be publisher"
    },
    {
      "label": 62,
      "data": "Inside Range Inside Range Outside Range Outside Range",
      "keywords": "Range, Inside, Outside",
      "explanation": "The sequence has some commonly used range keywords so the label should be range"
    },
    {
      "label": 62,
      "data": "Alaska Saint Elias Alaska Wrangell Wrangell Wrangell Saint Elias Saint Elias Saint Elias Saint Elias Saint Elias Alaska Alaska Sierra Saint Elias Saint Elias Sawatch Sawatch Sawatch Cascade Sierra Sangre de Cristo Sawatch San Juan Sangre de Cristo Mosquito Front Sawatch Front Elk Mosquito Front Front San Juan White Mtn Sierra Sawatch Sangre de Cristo Sawatch Sawatch Sawatch Mosquito Sangre de Cristo Wrangell Cascade Sierra San Juan Elk Sawatch Sawatch San Juan Mosquito Elk Front Elk San Juan Sierra San Juan Sierra Sawatch Saint Elias Sawatch Sangre de Cristo Front San Juan Sierra San Juan Culebra Sangre de Cristo Sangre de Cristo Sierra Sangre de Cristo Mosquito San Juan Sierra Elk Sierra San Juan San Juan Sierra Elk San Juan Sawatch Sawatch San Juan Sierra Sierra",
      "keywords": "Mtn, Saint, Elk",
      "explanation": "The sequence has some commonly used range keywords so the label should be range"
    },
    {
      "label": 8,
      "data": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42",
      "keywords": "41, 35, 33",
      "explanation": "The sequence has some commonly used rank keywords so the label should be rank"
    },
    {
      "label": 8,
      "data": "1 2 3 4 5 6 7 8",
      "keywords": "7, 5, 4",
      "explanation": "The sequence has some commonly used rank keywords so the label should be rank"
    },
    {
      "label": 64,
      "data": "13rd 14th 15th",
      "keywords": "15th, 13rd, 14th",
      "explanation": "The sequence has some commonly used ranking keywords so the label should be ranking"
    },
    {
      "label": 64,
      "data": "4 5 6 7 8 9 10 11",
      "keywords": "5, 8, 7",
      "explanation": "The sequence has some commonly used ranking keywords so the label should be ranking"
    },
    {
      "label": 34,
      "data": "Europe North America",
      "keywords": "Europe, America, North",
      "explanation": "The sequence has some commonly used region keywords so the label should be region"
    },
    {
      "label": 34,
      "data": "Greater Gorongosa Ecosystem Greater Gorongosa Ecosystem Mozambique Greater Gorongosa Ecosystem Greater Gorongosa Ecosystem Greater Gorongosa Ecosystem Greater Gorongosa Ecosystem Greater Gorongosa Ecosystem Mozambique Greater Gorongosa Ecosystem Greater Gorongosa Ecosystem Greater Gorongosa Ecosystem Mozambique Greater Gorongosa Ecosystem Greater Gorongosa Ecosystem Greater Gorongosa Ecosystem Greater Gorongosa Ecosystem Greater Gorongosa Ecosystem Greater Gorongosa Ecosystem Greater Gorongosa Ecosystem Greater Gorongosa Ecosystem Greater Gorongosa Ecosystem Greater Gorongosa Ecosystem Greater Gorongosa Ecosystem Greater Gorongosa Ecosystem",
      "keywords": "Ecosystem, Gorongosa, Greater",
      "explanation": "The sequence has some commonly used region keywords so the label should be region"
    },
    {
      "label": 69,
      "data": "Christians Evangelicals Muslim",
      "keywords": "Christians, Muslim, Evangelicals",
      "explanation": "The sequence has some commonly used religion keywords so the label should be religion"
    },
    {
      "label": 69,
      "data": "Catholic Evangelical Protestant Black Protestant Mainline Protestant Other None",
      "keywords": "Protestant, Catholic, Mainline",
      "explanation": "The sequence has some commonly used religion keywords so the label should be religion"
    },
    {
      "label": 72,
      "data": "Qt libz libbz2 libxml2 Clucene Exiv2 FFMPEG DBus FAM Log4cxx CppUnit",
      "keywords": "Exiv2, FFMPEG, libxml2",
      "explanation": "The sequence has some commonly used requirement keywords so the label should be requirement"
    },
    {
      "label": 72,
      "data": "University Core Kinesiology Core KIN 099 KIN 105 KIN 107 KIN 150 KIN 211 KIN 308 KIN 322 KIN 350 KIN 360 KIN 420 KIN 421 KIN 430 Sports Management KIN 401 KIN 410 KIN 482 KIN 460 ACC 201 ACC 202 ECO 232 FIN 341 MGT 371 MKT 381 General Electives Total Hours",
      "keywords": "Total, MGT, 232",
      "explanation": "The sequence has some commonly used requirement keywords so the label should be requirement"
    },
    {
      "label": 16,
      "data": "L 3-5 L 2-0 W 2-0 T 1-1 L 0-2 L 0-2 W 2-4 T 1-1 L 0-1 W 1-3 W 2-1 L 1-0 L 4-1 T 4-4 T 1-1 W 0-3 L 0-1 T 0-0 T 1-1 L 1-0 W 0-1 L 1-2 L 2-1 L 3-1 W 1-0 L 0-1 W 0-2 T 0-0 T 2-2 W 2-3 W 3-1 L 0-3 W 0-2 L 0-2 W 0-1 T 2-2 L 2-4 T 2-2 L 0-3 L 2-0 L 0-3 L 0-3 L 0-2 W 0-1 L 5-2 W 0-1 W 4-1 T 1-1 L 0-4 T 0-0 L 0-2 L 4-1 L 1-2 W 0-1 W 0-4 W 2-1 L 3-0 T 0-0 W 0-1 T 1-1 W 1-5 W 1-0 L 4-1 L 0-2 T 1-1 L 0-5 W 1-3 L 0-1 W 1-3 T 1-1 W 2-1 W 0-1 L 0-2 T 0-0 L 0-2 T 1-1 T 1-1 L 2-0 L 1-0 W 4-0 W 1-0 T 1-1 T 1-1 W 1-2 L 0-2 W 0-2 W 1-2 L 2-3 W 0-2 L 0-2 W 1-3 T 1-1 W 0-2 L 1-3 T 1-1 W 0-1 L 1-3 T 1-1 T 2-2 L 0-2 W 0-2 W 2-0 W 0-3 W 1-2 W 0-4 T 0-0 T 0-0 W 1-2 L 2-4 T 3-3 W 1-2 L 1-3 W 1-2 T 2-2 T 0-0 W 0-1 L 0-1 L 2-3 T 2-2 T 1-1 L 0-2 W 1-0 W 1-0 W 1-3 W 2-0 T 1-1 W 1-0 W 1-2 T 2-2 L 0-3 L 0-1 W 2-3 T 1-1 W 1-2 T 1-1 W 1-3 L 0-3 T 1-1 W 0-2 T 0-0 T 2-2 L 2-0 W 1-2 L 0-2 T 2-2 L 0-1 T 2-2 T 0-0 L 1-2 L 2-1 W 1-4 T 1-1 W 0-1 W 1-3 T 1-1 T 1-1 L 1-0 W 1-2 W 1-0 L 2-1 T 1-1 W 3-1 L 3-4 L 2-1 L 2-1 L 0-3 W 3-4 L 0-1 L 0-2 T 2-2 L 0-3 T 0-0 T 1-1 T 2-2 L 1-4 L 1-2 L 3-2 W 0-2 L 1-3 W 2-0 L 1-0 W 0-3 L 0-2 W 0-3 L 2-0 W 1-2 T 1-1",
      "keywords": "3-4, 5-2, 0-4",
      "explanation": "The sequence has some commonly used result keywords so the label should be result"
    },
    {
      "label": 16,
      "data": "win loss",
      "keywords": "loss, win",
      "explanation": "The sequence has some commonly used result keywords so the label should be result"
    },
    {
      "label": 74,
      "data": "2,565 3,048 1,914 2,602 10,129",
      "keywords": "10,129, 3,048, 2,602",
      "explanation": "The sequence has some commonly used sales keywords so the label should be sales"
    },
    {
      "label": 74,
      "data": "319 241 345 208 817 343 182",
      "keywords": "817, 319, 208",
      "explanation": "The sequence has some commonly used sales keywords so the label should be sales"
    },
    {
      "label": 37,
      "data": "Expedited Shipping (USPS Priority Mail®) Local Pickup",
      "keywords": "Pickup, Local, Shipping",
      "explanation": "The sequence has some commonly used service keywords so the label should be service"
    },
    {
      "label": 37,
      "data": "CERT Advisory Mailing List Windows and .NET Magazine Security UPDATE NTBugtraq",
      "keywords": ".NET, Windows, NTBugtraq",
      "explanation": "The sequence has some commonly used service keywords so the label should be service"
    },
    {
      "label": 31,
      "data": "M M M F F M",
      "keywords": "F, M",
      "explanation": "The sequence has some commonly used sex keywords so the label should be sex"
    },
    {
      "label": 31,
      "data": "M M M M M M M M M M M",
      "keywords": "M",
      "explanation": "The sequence has some commonly used sex keywords so the label should be sex"
    },
    {
      "label": 59,
      "data": "Human Human",
      "keywords": "Human",
      "explanation": "The sequence has some commonly used species keywords so the label should be species"
    },
    {
      "label": 59,
      "data": "Lesser Kestrel Falco naumanni Pallid Harrier Circus macrourus Arabian Bustard Ardeotis arabs Savile's Bustard Lophotis savilei African Collared-dove Streptopelia roseogrisea Golden Nightjar Caprimulgus eximius Kordofan Lark Mirafra cordofanica Rusty Lark Mirafra rufa Cricket Longtail Spiloptila clamans Chestnut-bellied Starling Lamprotornis pulcher Black Scrub-robin Cercotrichas podobe",
      "keywords": "Circus, cordofanica, arabs",
      "explanation": "The sequence has some commonly used species keywords so the label should be species"
    },
    {
      "label": 10,
      "data": "FL FL FL FL AL LA DC PA NY MA NY PA OH IL MN IN MO KS CO CO CO MT OR WA OR CA CA CA CA NV TN TN GA TN LA LA LA LA LA NY NY NY NY LA CA CA KY OH NY CT CT CT LA LA SC SC NC MD VT VT ME VA NC VA NC GA FL NY LA TX TX TX AR LA 23 LA LA",
      "keywords": "FL, ME, MO",
      "explanation": "The sequence has some commonly used state keywords so the label should be state"
    },
    {
      "label": 10,
      "data": "MN MN MN MN",
      "keywords": "MN",
      "explanation": "The sequence has some commonly used state keywords so the label should be state"
    },
    {
      "label": 9,
      "data": "None None None None None None",
      "keywords": "None",
      "explanation": "The sequence has some commonly used status keywords so the label should be status"
    },
    {
      "label": 9,
      "data": "Unavailable Unavailable Unavailable Unavailable",
      "keywords": "Unavailable",
      "explanation": "The sequence has some commonly used status keywords so the label should be status"
    },
    {
      "label": 22,
      "data": "AZPN AZPN AZPN AZPN AZPN AZPN AZPN",
      "keywords": "AZPN",
      "explanation": "The sequence has some commonly used symbol keywords so the label should be symbol"
    },
    {
      "label": 22,
      "data": "S3345:SM GPLS:US GEPC:US 000791:CH XEB:CN EMBE:LN JAPAULOI:NL PTJYY:US JPFA:IJ 1JC1:GR JAP:SP JPIN:IN JPEP:US 0JP:GR",
      "keywords": "PTJYY, LN, JAP",
      "explanation": "The sequence has some commonly used symbol keywords so the label should be symbol"
    },
    {
      "label": 2,
      "data": "ThuAd WRIGH ThuAd ThuAd SAYAR",
      "keywords": "ThuAd, SAYAR, WRIGH",
      "explanation": "The sequence has some commonly used team keywords so the label should be team"
    },
    {
      "label": 2,
      "data": "Alabama Oregon Clemson Florida State Ohio State LSU UCLA Louisville Miami (FL) South Carolina Texas A&M Stanford Baylor Missouri Texas Tech Georgia Oklahoma St. Nebraska Oklahoma Michigan Fresno State North. Illinois Oregon State Michigan St. Wisconsin",
      "keywords": "Carolina, Clemson, Oklahoma",
      "explanation": "The sequence has some commonly used team keywords so the label should be team"
    },
    {
      "label": 38,
      "data": "Tri-State Velo/Amorosos Racing Team Tri-State Velo/Amoroso's Racing Team Tri-State Velo/Amoroso's Racing Team Tri-State Velo/Amoroso's Racing Team TRI-STATE VELO/AMOROSO'S RACING TEAM Tri-State Velo/Amoroso's Racing Team Amoroso's Racing Team Amoroso's Racing Team Tri-State Velo/Amoroso's Racing Team Tri-State Velo/Amoroso's Racing Team Tri-State Velo / Amoroso's Raci Tri-State Velo/Amoroso's Racing Tri-State Velo/Amoroso's Racing Tri-State Velo/Amoroso's Racing Team Tri-State Velo/Amoroso's Racing Team Tri-State Velo/Amoroso's Racing Team Tri-State Velo/Amoroso's Racing Tri-State Velo/Amoroso's Racing Team Tri-state Velo/amoroso's Racing Team Tri-State Velo/Amoroso's Racing Team Tri-State Velo/Amoroso's Racing Team Amoroso's Racing Team",
      "keywords": "'S, Velo/Amorosos, Tri-State",
      "explanation": "The sequence has some commonly used teamName keywords so the label should be teamName"
    },
    {
      "label": 38,
      "data": "Unattached Unattached",
      "keywords": "Unattached",
      "explanation": "The sequence has some commonly used teamName keywords so the label should be teamName"
    },
    {
      "label": 4,
      "data": "target target",
      "keywords": "target",
      "explanation": "The sequence has some commonly used type keywords so the label should be type"
    },
    {
      "label": 4,
      "data": "sponsor co-sponsor",
      "keywords": "sponsor, co-sponsor",
      "explanation": "The sequence has some commonly used type keywords so the label should be type"
    },
    {
      "label": 12,
      "data": "17-22 lbs 22-27 lbs 27-30 lbs",
      "keywords": "lbs, 27-30, 17-22",
      "explanation": "The sequence has some commonly used weight keywords so the label should be weight"
    },
    {
      "label": 12,
      "data": "22 oz. 26 oz. 1 lbs. 12 oz. 2 lb. 2 oz. 2 lbs. 10 oz. 3 lbs. 7 lb. 8 oz. 7 lb. 4 oz. 8 lb. 3 oz. 138 oz. 9 lb. 12 oz. 10 lb. 8 oz. 6 lb. 11 oz. 6lb 9oz 8lb 3oz 9 lb. 5 oz. 2 lb. 14 oz.",
      "keywords": "3, 22, 4",
      "explanation": "The sequence has some commonly used weight keywords so the label should be weight"
    },
    {
      "label": 6,
      "data": "2007 2009 1994 1994 1995 2001 2003 2009 2006 1996 2004 2003 1994 1994 1998 1999 2000 2000 1998 2001 1997 1998 1996 1999 2003 2001 2002 2006 1999 2000 2001 2002 2006 1989 1989 1990 1990 1991 1991 1992 1992 1993 1993 1994 1994 1995 1995 1993 1990 1993",
      "keywords": "1998, 1999, 2006",
      "explanation": "The sequence has some commonly used year keywords so the label should be year"
    },
    {
      "label": 6,
      "data": "All Years All Years All Years All Years",
      "keywords": "Years, All",
      "explanation": "The sequence has some commonly used year keywords so the label should be year"
    }
  ]
}